GopalSaraf/Practicals/PSDL/include/proc/pic16lf1777.inc
// Register: DAC2CON0
#define DAC2CON0 DAC2CON0
DAC2CON0                                 equ 0591h
// bitfield definitions
DAC2CON0_NSS_POSN                        equ 0000h
DAC2CON0_NSS_POSITION                    equ 0000h
DAC2CON0_NSS_SIZE                        equ 0002h
DAC2CON0_NSS_LENGTH                      equ 0002h
DAC2CON0_NSS_MASK                        equ 0003h
DAC2CON0_PSS_POSN                        equ 0002h
DAC2CON0_PSS_POSITION                    equ 0002h
DAC2CON0_PSS_SIZE                        equ 0002h
DAC2CON0_PSS_LENGTH                      equ 0002h
DAC2CON0_PSS_MASK                        equ 000Ch
DAC2CON0_OE2_POSN                        equ 0004h
DAC2CON0_OE2_POSITION                    equ 0004h
DAC2CON0_OE2_SIZE                        equ 0001h
DAC2CON0_OE2_LENGTH                      equ 0001h
DAC2CON0_OE2_MASK                        equ 0010h
DAC2CON0_OE1_POSN                        equ 0005h
DAC2CON0_OE1_POSITION                    equ 0005h
DAC2CON0_OE1_SIZE                        equ 0001h
DAC2CON0_OE1_LENGTH                      equ 0001h
DAC2CON0_OE1_MASK                        equ 0020h
DAC2CON0_FM_POSN                         equ 0006h
DAC2CON0_FM_POSITION                     equ 0006h
DAC2CON0_FM_SIZE                         equ 0001h
DAC2CON0_FM_LENGTH                       equ 0001h
DAC2CON0_FM_MASK                         equ 0040h
DAC2CON0_EN_POSN                         equ 0007h
DAC2CON0_EN_POSITION                     equ 0007h
DAC2CON0_EN_SIZE                         equ 0001h
DAC2CON0_EN_LENGTH                       equ 0001h
DAC2CON0_EN_MASK                         equ 0080h
DAC2CON0_NSS0_POSN                       equ 0000h
DAC2CON0_NSS0_POSITION                   equ 0000h
DAC2CON0_NSS0_SIZE                       equ 0001h
DAC2CON0_NSS0_LENGTH                     equ 0001h
DAC2CON0_NSS0_MASK                       equ 0001h
DAC2CON0_NSS1_POSN                       equ 0001h
DAC2CON0_NSS1_POSITION                   equ 0001h
DAC2CON0_NSS1_SIZE                       equ 0001h
DAC2CON0_NSS1_LENGTH                     equ 0001h
DAC2CON0_NSS1_MASK                       equ 0002h
DAC2CON0_PSS0_POSN                       equ 0002h
DAC2CON0_PSS0_POSITION                   equ 0002h
DAC2CON0_PSS0_SIZE                       equ 0001h
DAC2CON0_PSS0_LENGTH                     equ 0001h
DAC2CON0_PSS0_MASK                       equ 0004h
DAC2CON0_PSS1_POSN                       equ 0003h
DAC2CON0_PSS1_POSITION                   equ 0003h
DAC2CON0_PSS1_SIZE                       equ 0001h
DAC2CON0_PSS1_LENGTH                     equ 0001h
DAC2CON0_PSS1_MASK                       equ 0008h
DAC2CON0_OE_POSN                         equ 0005h
DAC2CON0_OE_POSITION                     equ 0005h
DAC2CON0_OE_SIZE                         equ 0001h
DAC2CON0_OE_LENGTH                       equ 0001h
DAC2CON0_OE_MASK                         equ 0020h
DAC2CON0_DACNSS_POSN                     equ 0000h
DAC2CON0_DACNSS_POSITION                 equ 0000h
DAC2CON0_DACNSS_SIZE                     equ 0002h
DAC2CON0_DACNSS_LENGTH                   equ 0002h
DAC2CON0_DACNSS_MASK                     equ 0003h
DAC2CON0_DACPSS_POSN                     equ 0002h
DAC2CON0_DACPSS_POSITION                 equ 0002h
DAC2CON0_DACPSS_SIZE                     equ 0002h
DAC2CON0_DACPSS_LENGTH                   equ 0002h
DAC2CON0_DACPSS_MASK                     equ 000Ch
DAC2CON0_DACOE2_POSN                     equ 0004h
DAC2CON0_DACOE2_POSITION                 equ 0004h
DAC2CON0_DACOE2_SIZE                     equ 0001h
DAC2CON0_DACOE2_LENGTH                   equ 0001h
DAC2CON0_DACOE2_MASK                     equ 0010h
DAC2CON0_DACOE1_POSN                     equ 0005h
DAC2CON0_DACOE1_POSITION                 equ 0005h
DAC2CON0_DACOE1_SIZE                     equ 0001h
DAC2CON0_DACOE1_LENGTH                   equ 0001h
DAC2CON0_DACOE1_MASK                     equ 0020h
DAC2CON0_DACFM_POSN                      equ 0006h
DAC2CON0_DACFM_POSITION                  equ 0006h
DAC2CON0_DACFM_SIZE                      equ 0001h
DAC2CON0_DACFM_LENGTH                    equ 0001h
DAC2CON0_DACFM_MASK                      equ 0040h
DAC2CON0_DACEN_POSN                      equ 0007h
DAC2CON0_DACEN_POSITION                  equ 0007h
DAC2CON0_DACEN_SIZE                      equ 0001h
DAC2CON0_DACEN_LENGTH                    equ 0001h
DAC2CON0_DACEN_MASK                      equ 0080h
DAC2CON0_DACNSS0_POSN                    equ 0000h
DAC2CON0_DACNSS0_POSITION                equ 0000h
DAC2CON0_DACNSS0_SIZE                    equ 0001h
DAC2CON0_DACNSS0_LENGTH                  equ 0001h
DAC2CON0_DACNSS0_MASK                    equ 0001h
DAC2CON0_DACNSS1_POSN                    equ 0001h
DAC2CON0_DACNSS1_POSITION                equ 0001h
DAC2CON0_DACNSS1_SIZE                    equ 0001h
DAC2CON0_DACNSS1_LENGTH                  equ 0001h
DAC2CON0_DACNSS1_MASK                    equ 0002h
DAC2CON0_DACPSS0_POSN                    equ 0002h
DAC2CON0_DACPSS0_POSITION                equ 0002h
DAC2CON0_DACPSS0_SIZE                    equ 0001h
DAC2CON0_DACPSS0_LENGTH                  equ 0001h
DAC2CON0_DACPSS0_MASK                    equ 0004h
DAC2CON0_DACPSS1_POSN                    equ 0003h
DAC2CON0_DACPSS1_POSITION                equ 0003h
DAC2CON0_DACPSS1_SIZE                    equ 0001h
DAC2CON0_DACPSS1_LENGTH                  equ 0001h
DAC2CON0_DACPSS1_MASK                    equ 0008h
DAC2CON0_DACOE_POSN                      equ 0005h
DAC2CON0_DACOE_POSITION                  equ 0005h
DAC2CON0_DACOE_SIZE                      equ 0001h
DAC2CON0_DACOE_LENGTH                    equ 0001h
DAC2CON0_DACOE_MASK                      equ 0020h
DAC2CON0_DAC2NSS_POSN                    equ 0000h
DAC2CON0_DAC2NSS_POSITION                equ 0000h
DAC2CON0_DAC2NSS_SIZE                    equ 0002h
DAC2CON0_DAC2NSS_LENGTH                  equ 0002h
DAC2CON0_DAC2NSS_MASK                    equ 0003h
DAC2CON0_DAC2PSS_POSN                    equ 0002h
DAC2CON0_DAC2PSS_POSITION                equ 0002h
DAC2CON0_DAC2PSS_SIZE                    equ 0002h
DAC2CON0_DAC2PSS_LENGTH                  equ 0002h
DAC2CON0_DAC2PSS_MASK                    equ 000Ch
DAC2CON0_DAC2OE2_POSN                    equ 0004h
DAC2CON0_DAC2OE2_POSITION                equ 0004h
DAC2CON0_DAC2OE2_SIZE                    equ 0001h
DAC2CON0_DAC2OE2_LENGTH                  equ 0001h
DAC2CON0_DAC2OE2_MASK                    equ 0010h
DAC2CON0_DAC2OE1_POSN                    equ 0005h
DAC2CON0_DAC2OE1_POSITION                equ 0005h
DAC2CON0_DAC2OE1_SIZE                    equ 0001h
DAC2CON0_DAC2OE1_LENGTH                  equ 0001h
DAC2CON0_DAC2OE1_MASK                    equ 0020h
DAC2CON0_DAC2FM_POSN                     equ 0006h
DAC2CON0_DAC2FM_POSITION                 equ 0006h
DAC2CON0_DAC2FM_SIZE                     equ 0001h
DAC2CON0_DAC2FM_LENGTH                   equ 0001h
DAC2CON0_DAC2FM_MASK                     equ 0040h
DAC2CON0_DAC2EN_POSN                     equ 0007h
DAC2CON0_DAC2EN_POSITION                 equ 0007h
DAC2CON0_DAC2EN_SIZE                     equ 0001h
DAC2CON0_DAC2EN_LENGTH                   equ 0001h
DAC2CON0_DAC2EN_MASK                     equ 0080h
DAC2CON0_DAC2NSS0_POSN                   equ 0000h
DAC2CON0_DAC2NSS0_POSITION               equ 0000h
DAC2CON0_DAC2NSS0_SIZE                   equ 0001h
DAC2CON0_DAC2NSS0_LENGTH                 equ 0001h
DAC2CON0_DAC2NSS0_MASK                   equ 0001h
DAC2CON0_DAC2NSS1_POSN                   equ 0001h
DAC2CON0_DAC2NSS1_POSITION               equ 0001h
DAC2CON0_DAC2NSS1_SIZE                   equ 0001h
DAC2CON0_DAC2NSS1_LENGTH                 equ 0001h
DAC2CON0_DAC2NSS1_MASK                   equ 0002h
DAC2CON0_DAC2PSS0_POSN                   equ 0002h
DAC2CON0_DAC2PSS0_POSITION               equ 0002h
DAC2CON0_DAC2PSS0_SIZE                   equ 0001h
DAC2CON0_DAC2PSS0_LENGTH                 equ 0001h
DAC2CON0_DAC2PSS0_MASK                   equ 0004h
DAC2CON0_DAC2PSS1_POSN                   equ 0003h
DAC2CON0_DAC2PSS1_POSITION               equ 0003h
DAC2CON0_DAC2PSS1_SIZE                   equ 0001h
DAC2CON0_DAC2PSS1_LENGTH                 equ 0001h
DAC2CON0_DAC2PSS1_MASK                   equ 0008h

