GopalSaraf/Practicals/PSDL/include/proc/pic16lf1777.inc
// Register: DAC7REF
#define DAC7REF DAC7REF
DAC7REF                                  equ 059Fh
// bitfield definitions
DAC7REF_DACR_POSN                        equ 0000h
DAC7REF_DACR_POSITION                    equ 0000h
DAC7REF_DACR_SIZE                        equ 0005h
DAC7REF_DACR_LENGTH                      equ 0005h
DAC7REF_DACR_MASK                        equ 001Fh
DAC7REF_DACR0_POSN                       equ 0000h
DAC7REF_DACR0_POSITION                   equ 0000h
DAC7REF_DACR0_SIZE                       equ 0001h
DAC7REF_DACR0_LENGTH                     equ 0001h
DAC7REF_DACR0_MASK                       equ 0001h
DAC7REF_DACR1_POSN                       equ 0001h
DAC7REF_DACR1_POSITION                   equ 0001h
DAC7REF_DACR1_SIZE                       equ 0001h
DAC7REF_DACR1_LENGTH                     equ 0001h
DAC7REF_DACR1_MASK                       equ 0002h
DAC7REF_DACR2_POSN                       equ 0002h
DAC7REF_DACR2_POSITION                   equ 0002h
DAC7REF_DACR2_SIZE                       equ 0001h
DAC7REF_DACR2_LENGTH                     equ 0001h
DAC7REF_DACR2_MASK                       equ 0004h
DAC7REF_DACR3_POSN                       equ 0003h
DAC7REF_DACR3_POSITION                   equ 0003h
DAC7REF_DACR3_SIZE                       equ 0001h
DAC7REF_DACR3_LENGTH                     equ 0001h
DAC7REF_DACR3_MASK                       equ 0008h
DAC7REF_DACR4_POSN                       equ 0004h
DAC7REF_DACR4_POSITION                   equ 0004h
DAC7REF_DACR4_SIZE                       equ 0001h
DAC7REF_DACR4_LENGTH                     equ 0001h
DAC7REF_DACR4_MASK                       equ 0010h
DAC7REF_R0_POSN                          equ 0000h
DAC7REF_R0_POSITION                      equ 0000h
DAC7REF_R0_SIZE                          equ 0001h
DAC7REF_R0_LENGTH                        equ 0001h
DAC7REF_R0_MASK                          equ 0001h
DAC7REF_R1_POSN                          equ 0001h
DAC7REF_R1_POSITION                      equ 0001h
DAC7REF_R1_SIZE                          equ 0001h
DAC7REF_R1_LENGTH                        equ 0001h
DAC7REF_R1_MASK                          equ 0002h
DAC7REF_R2_POSN                          equ 0002h
DAC7REF_R2_POSITION                      equ 0002h
DAC7REF_R2_SIZE                          equ 0001h
DAC7REF_R2_LENGTH                        equ 0001h
DAC7REF_R2_MASK                          equ 0004h
DAC7REF_R3_POSN                          equ 0003h
DAC7REF_R3_POSITION                      equ 0003h
DAC7REF_R3_SIZE                          equ 0001h
DAC7REF_R3_LENGTH                        equ 0001h
DAC7REF_R3_MASK                          equ 0008h
DAC7REF_R4_POSN                          equ 0004h
DAC7REF_R4_POSITION                      equ 0004h
DAC7REF_R4_SIZE                          equ 0001h
DAC7REF_R4_LENGTH                        equ 0001h
DAC7REF_R4_MASK                          equ 0010h
DAC7REF_DAC7R_POSN                       equ 0000h
DAC7REF_DAC7R_POSITION                   equ 0000h
DAC7REF_DAC7R_SIZE                       equ 0005h
DAC7REF_DAC7R_LENGTH                     equ 0005h
DAC7REF_DAC7R_MASK                       equ 001Fh
DAC7REF_DAC7R0_POSN                      equ 0000h
DAC7REF_DAC7R0_POSITION                  equ 0000h
DAC7REF_DAC7R0_SIZE                      equ 0001h
DAC7REF_DAC7R0_LENGTH                    equ 0001h
DAC7REF_DAC7R0_MASK                      equ 0001h
DAC7REF_DAC7R1_POSN                      equ 0001h
DAC7REF_DAC7R1_POSITION                  equ 0001h
DAC7REF_DAC7R1_SIZE                      equ 0001h
DAC7REF_DAC7R1_LENGTH                    equ 0001h
DAC7REF_DAC7R1_MASK                      equ 0002h
DAC7REF_DAC7R2_POSN                      equ 0002h
DAC7REF_DAC7R2_POSITION                  equ 0002h
DAC7REF_DAC7R2_SIZE                      equ 0001h
DAC7REF_DAC7R2_LENGTH                    equ 0001h
DAC7REF_DAC7R2_MASK                      equ 0004h
DAC7REF_DAC7R3_POSN                      equ 0003h
DAC7REF_DAC7R3_POSITION                  equ 0003h
DAC7REF_DAC7R3_SIZE                      equ 0001h
DAC7REF_DAC7R3_LENGTH                    equ 0001h
DAC7REF_DAC7R3_MASK                      equ 0008h
DAC7REF_DAC7R4_POSN                      equ 0004h
DAC7REF_DAC7R4_POSITION                  equ 0004h
DAC7REF_DAC7R4_SIZE                      equ 0001h
DAC7REF_DAC7R4_LENGTH                    equ 0001h
DAC7REF_DAC7R4_MASK                      equ 0010h
DAC7REF_REF0_POSN                        equ 0000h
DAC7REF_REF0_POSITION                    equ 0000h
DAC7REF_REF0_SIZE                        equ 0001h
DAC7REF_REF0_LENGTH                      equ 0001h
DAC7REF_REF0_MASK                        equ 0001h
DAC7REF_REF1_POSN                        equ 0001h
DAC7REF_REF1_POSITION                    equ 0001h
DAC7REF_REF1_SIZE                        equ 0001h
DAC7REF_REF1_LENGTH                      equ 0001h
DAC7REF_REF1_MASK                        equ 0002h
DAC7REF_REF2_POSN                        equ 0002h
DAC7REF_REF2_POSITION                    equ 0002h
DAC7REF_REF2_SIZE                        equ 0001h
DAC7REF_REF2_LENGTH                      equ 0001h
DAC7REF_REF2_MASK                        equ 0004h
DAC7REF_REF3_POSN                        equ 0003h
DAC7REF_REF3_POSITION                    equ 0003h
DAC7REF_REF3_SIZE                        equ 0001h
DAC7REF_REF3_LENGTH                      equ 0001h
DAC7REF_REF3_MASK                        equ 0008h
DAC7REF_REF4_POSN                        equ 0004h
DAC7REF_REF4_POSITION                    equ 0004h
DAC7REF_REF4_SIZE                        equ 0001h
DAC7REF_REF4_LENGTH                      equ 0001h
DAC7REF_REF4_MASK                        equ 0010h
DAC7REF_DAC7REF0_POSN                    equ 0000h
DAC7REF_DAC7REF0_POSITION                equ 0000h
DAC7REF_DAC7REF0_SIZE                    equ 0001h
DAC7REF_DAC7REF0_LENGTH                  equ 0001h
DAC7REF_DAC7REF0_MASK                    equ 0001h
DAC7REF_DAC7REF1_POSN                    equ 0001h
DAC7REF_DAC7REF1_POSITION                equ 0001h
DAC7REF_DAC7REF1_SIZE                    equ 0001h
DAC7REF_DAC7REF1_LENGTH                  equ 0001h
DAC7REF_DAC7REF1_MASK                    equ 0002h
DAC7REF_DAC7REF2_POSN                    equ 0002h
DAC7REF_DAC7REF2_POSITION                equ 0002h
DAC7REF_DAC7REF2_SIZE                    equ 0001h
DAC7REF_DAC7REF2_LENGTH                  equ 0001h
DAC7REF_DAC7REF2_MASK                    equ 0004h
DAC7REF_DAC7REF3_POSN                    equ 0003h
DAC7REF_DAC7REF3_POSITION                equ 0003h
DAC7REF_DAC7REF3_SIZE                    equ 0001h
DAC7REF_DAC7REF3_LENGTH                  equ 0001h
DAC7REF_DAC7REF3_MASK                    equ 0008h
DAC7REF_DAC7REF4_POSN                    equ 0004h
DAC7REF_DAC7REF4_POSITION                equ 0004h
DAC7REF_DAC7REF4_SIZE                    equ 0001h
DAC7REF_DAC7REF4_LENGTH                  equ 0001h
DAC7REF_DAC7REF4_MASK                    equ 0010h

// Register: DAC8CON0
#define DAC8CON0 DAC8CON0
DAC8CON0                                 equ 060Ch
// bitfield definitions
DAC8CON0_NSS_POSN                        equ 0000h
DAC8CON0_NSS_POSITION                    equ 0000h
DAC8CON0_NSS_SIZE                        equ 0002h
DAC8CON0_NSS_LENGTH                      equ 0002h
DAC8CON0_NSS_MASK                        equ 0003h
DAC8CON0_PSS_POSN                        equ 0002h
DAC8CON0_PSS_POSITION                    equ 0002h
DAC8CON0_PSS_SIZE                        equ 0002h
DAC8CON0_PSS_LENGTH                      equ 0002h
DAC8CON0_PSS_MASK                        equ 000Ch
DAC8CON0_OE2_POSN                        equ 0004h
DAC8CON0_OE2_POSITION                    equ 0004h
DAC8CON0_OE2_SIZE                        equ 0001h
DAC8CON0_OE2_LENGTH                      equ 0001h
DAC8CON0_OE2_MASK                        equ 0010h
DAC8CON0_OE1_POSN                        equ 0005h
DAC8CON0_OE1_POSITION                    equ 0005h
DAC8CON0_OE1_SIZE                        equ 0001h
DAC8CON0_OE1_LENGTH                      equ 0001h
DAC8CON0_OE1_MASK                        equ 0020h
DAC8CON0_EN_POSN                         equ 0007h
DAC8CON0_EN_POSITION                     equ 0007h
DAC8CON0_EN_SIZE                         equ 0001h
DAC8CON0_EN_LENGTH                       equ 0001h
DAC8CON0_EN_MASK                         equ 0080h
DAC8CON0_NSS0_POSN                       equ 0000h
DAC8CON0_NSS0_POSITION                   equ 0000h
DAC8CON0_NSS0_SIZE                       equ 0001h
DAC8CON0_NSS0_LENGTH                     equ 0001h
DAC8CON0_NSS0_MASK                       equ 0001h
DAC8CON0_NSS1_POSN                       equ 0001h
DAC8CON0_NSS1_POSITION                   equ 0001h
DAC8CON0_NSS1_SIZE                       equ 0001h
DAC8CON0_NSS1_LENGTH                     equ 0001h
DAC8CON0_NSS1_MASK                       equ 0002h
DAC8CON0_PSS0_POSN                       equ 0002h
DAC8CON0_PSS0_POSITION                   equ 0002h
DAC8CON0_PSS0_SIZE                       equ 0001h
DAC8CON0_PSS0_LENGTH                     equ 0001h
DAC8CON0_PSS0_MASK                       equ 0004h
DAC8CON0_PSS1_POSN                       equ 0003h
DAC8CON0_PSS1_POSITION                   equ 0003h
DAC8CON0_PSS1_SIZE                       equ 0001h
DAC8CON0_PSS1_LENGTH                     equ 0001h
DAC8CON0_PSS1_MASK                       equ 0008h
DAC8CON0_DACNSS_POSN                     equ 0000h
DAC8CON0_DACNSS_POSITION                 equ 0000h
DAC8CON0_DACNSS_SIZE                     equ 0002h
DAC8CON0_DACNSS_LENGTH                   equ 0002h
DAC8CON0_DACNSS_MASK                     equ 0003h
DAC8CON0_DACPSS_POSN                     equ 0002h
DAC8CON0_DACPSS_POSITION                 equ 0002h
DAC8CON0_DACPSS_SIZE                     equ 0002h
DAC8CON0_DACPSS_LENGTH                   equ 0002h
DAC8CON0_DACPSS_MASK                     equ 000Ch
DAC8CON0_DACOE2_POSN                     equ 0004h
DAC8CON0_DACOE2_POSITION                 equ 0004h
DAC8CON0_DACOE2_SIZE                     equ 0001h
DAC8CON0_DACOE2_LENGTH                   equ 0001h
DAC8CON0_DACOE2_MASK                     equ 0010h
DAC8CON0_DACOE1_POSN                     equ 0005h
DAC8CON0_DACOE1_POSITION                 equ 0005h
DAC8CON0_DACOE1_SIZE                     equ 0001h
DAC8CON0_DACOE1_LENGTH                   equ 0001h
DAC8CON0_DACOE1_MASK                     equ 0020h
DAC8CON0_DACEN_POSN                      equ 0007h
DAC8CON0_DACEN_POSITION                  equ 0007h
DAC8CON0_DACEN_SIZE                      equ 0001h
DAC8CON0_DACEN_LENGTH                    equ 0001h
DAC8CON0_DACEN_MASK                      equ 0080h
DAC8CON0_DACNSS0_POSN                    equ 0000h
DAC8CON0_DACNSS0_POSITION                equ 0000h
DAC8CON0_DACNSS0_SIZE                    equ 0001h
DAC8CON0_DACNSS0_LENGTH                  equ 0001h
DAC8CON0_DACNSS0_MASK                    equ 0001h
DAC8CON0_DACNSS1_POSN                    equ 0001h
DAC8CON0_DACNSS1_POSITION                equ 0001h
DAC8CON0_DACNSS1_SIZE                    equ 0001h
DAC8CON0_DACNSS1_LENGTH                  equ 0001h
DAC8CON0_DACNSS1_MASK                    equ 0002h
DAC8CON0_DACPSS0_POSN                    equ 0002h
DAC8CON0_DACPSS0_POSITION                equ 0002h
DAC8CON0_DACPSS0_SIZE                    equ 0001h
DAC8CON0_DACPSS0_LENGTH                  equ 0001h
DAC8CON0_DACPSS0_MASK                    equ 0004h
DAC8CON0_DACPSS1_POSN                    equ 0003h
DAC8CON0_DACPSS1_POSITION                equ 0003h
DAC8CON0_DACPSS1_SIZE                    equ 0001h
DAC8CON0_DACPSS1_LENGTH                  equ 0001h
DAC8CON0_DACPSS1_MASK                    equ 0008h
DAC8CON0_DAC8NSS_POSN                    equ 0000h
DAC8CON0_DAC8NSS_POSITION                equ 0000h
DAC8CON0_DAC8NSS_SIZE                    equ 0002h
DAC8CON0_DAC8NSS_LENGTH                  equ 0002h
DAC8CON0_DAC8NSS_MASK                    equ 0003h
DAC8CON0_DAC8PSS_POSN                    equ 0002h
DAC8CON0_DAC8PSS_POSITION                equ 0002h
DAC8CON0_DAC8PSS_SIZE                    equ 0002h
DAC8CON0_DAC8PSS_LENGTH                  equ 0002h
DAC8CON0_DAC8PSS_MASK                    equ 000Ch
DAC8CON0_DAC8OE2_POSN                    equ 0004h
DAC8CON0_DAC8OE2_POSITION                equ 0004h
DAC8CON0_DAC8OE2_SIZE                    equ 0001h
DAC8CON0_DAC8OE2_LENGTH                  equ 0001h
DAC8CON0_DAC8OE2_MASK                    equ 0010h
DAC8CON0_DAC8OE1_POSN                    equ 0005h
DAC8CON0_DAC8OE1_POSITION                equ 0005h
DAC8CON0_DAC8OE1_SIZE                    equ 0001h
DAC8CON0_DAC8OE1_LENGTH                  equ 0001h
DAC8CON0_DAC8OE1_MASK                    equ 0020h
DAC8CON0_DAC8EN_POSN                     equ 0007h
DAC8CON0_DAC8EN_POSITION                 equ 0007h
DAC8CON0_DAC8EN_SIZE                     equ 0001h
DAC8CON0_DAC8EN_LENGTH                   equ 0001h
DAC8CON0_DAC8EN_MASK                     equ 0080h
DAC8CON0_DAC8NSS0_POSN                   equ 0000h
DAC8CON0_DAC8NSS0_POSITION               equ 0000h
DAC8CON0_DAC8NSS0_SIZE                   equ 0001h
DAC8CON0_DAC8NSS0_LENGTH                 equ 0001h
DAC8CON0_DAC8NSS0_MASK                   equ 0001h
DAC8CON0_DAC8NSS1_POSN                   equ 0001h
DAC8CON0_DAC8NSS1_POSITION               equ 0001h
DAC8CON0_DAC8NSS1_SIZE                   equ 0001h
DAC8CON0_DAC8NSS1_LENGTH                 equ 0001h
DAC8CON0_DAC8NSS1_MASK                   equ 0002h
DAC8CON0_DAC8PSS0_POSN                   equ 0002h
DAC8CON0_DAC8PSS0_POSITION               equ 0002h
DAC8CON0_DAC8PSS0_SIZE                   equ 0001h
DAC8CON0_DAC8PSS0_LENGTH                 equ 0001h
DAC8CON0_DAC8PSS0_MASK                   equ 0004h
DAC8CON0_DAC8PSS1_POSN                   equ 0003h
DAC8CON0_DAC8PSS1_POSITION               equ 0003h
DAC8CON0_DAC8PSS1_SIZE                   equ 0001h
DAC8CON0_DAC8PSS1_LENGTH                 equ 0001h
DAC8CON0_DAC8PSS1_MASK                   equ 0008h

// Register: DAC8REF
#define DAC8REF DAC8REF
DAC8REF                                  equ 060Dh
// bitfield definitions
DAC8REF_DACR_POSN                        equ 0000h
DAC8REF_DACR_POSITION                    equ 0000h
DAC8REF_DACR_SIZE                        equ 0005h
DAC8REF_DACR_LENGTH                      equ 0005h
DAC8REF_DACR_MASK                        equ 001Fh
DAC8REF_DACR0_POSN                       equ 0000h
DAC8REF_DACR0_POSITION                   equ 0000h
DAC8REF_DACR0_SIZE                       equ 0001h
DAC8REF_DACR0_LENGTH                     equ 0001h
DAC8REF_DACR0_MASK                       equ 0001h
DAC8REF_DACR1_POSN                       equ 0001h
DAC8REF_DACR1_POSITION                   equ 0001h
DAC8REF_DACR1_SIZE                       equ 0001h
DAC8REF_DACR1_LENGTH                     equ 0001h
DAC8REF_DACR1_MASK                       equ 0002h
DAC8REF_DACR2_POSN                       equ 0002h
DAC8REF_DACR2_POSITION                   equ 0002h
DAC8REF_DACR2_SIZE                       equ 0001h
DAC8REF_DACR2_LENGTH                     equ 0001h
DAC8REF_DACR2_MASK                       equ 0004h
DAC8REF_DACR3_POSN                       equ 0003h
DAC8REF_DACR3_POSITION                   equ 0003h
DAC8REF_DACR3_SIZE                       equ 0001h
DAC8REF_DACR3_LENGTH                     equ 0001h
DAC8REF_DACR3_MASK                       equ 0008h
DAC8REF_DACR4_POSN                       equ 0004h
DAC8REF_DACR4_POSITION                   equ 0004h
DAC8REF_DACR4_SIZE                       equ 0001h
DAC8REF_DACR4_LENGTH                     equ 0001h
DAC8REF_DACR4_MASK                       equ 0010h
DAC8REF_R0_POSN                          equ 0000h
DAC8REF_R0_POSITION                      equ 0000h
DAC8REF_R0_SIZE                          equ 0001h
DAC8REF_R0_LENGTH                        equ 0001h
DAC8REF_R0_MASK                          equ 0001h
DAC8REF_R1_POSN                          equ 0001h
DAC8REF_R1_POSITION                      equ 0001h
DAC8REF_R1_SIZE                          equ 0001h
DAC8REF_R1_LENGTH                        equ 0001h
DAC8REF_R1_MASK                          equ 0002h
DAC8REF_R2_POSN                          equ 0002h
DAC8REF_R2_POSITION                      equ 0002h
DAC8REF_R2_SIZE                          equ 0001h
DAC8REF_R2_LENGTH                        equ 0001h
DAC8REF_R2_MASK                          equ 0004h
DAC8REF_R3_POSN                          equ 0003h
DAC8REF_R3_POSITION                      equ 0003h
DAC8REF_R3_SIZE                          equ 0001h
DAC8REF_R3_LENGTH                        equ 0001h
DAC8REF_R3_MASK                          equ 0008h
DAC8REF_R4_POSN                          equ 0004h
DAC8REF_R4_POSITION                      equ 0004h
DAC8REF_R4_SIZE                          equ 0001h
DAC8REF_R4_LENGTH                        equ 0001h
DAC8REF_R4_MASK                          equ 0010h
DAC8REF_DAC8R_POSN                       equ 0000h
DAC8REF_DAC8R_POSITION                   equ 0000h
DAC8REF_DAC8R_SIZE                       equ 0005h
DAC8REF_DAC8R_LENGTH                     equ 0005h
DAC8REF_DAC8R_MASK                       equ 001Fh
DAC8REF_DAC8R0_POSN                      equ 0000h
DAC8REF_DAC8R0_POSITION                  equ 0000h
DAC8REF_DAC8R0_SIZE                      equ 0001h
DAC8REF_DAC8R0_LENGTH                    equ 0001h
DAC8REF_DAC8R0_MASK                      equ 0001h
DAC8REF_DAC8R1_POSN                      equ 0001h
DAC8REF_DAC8R1_POSITION                  equ 0001h
DAC8REF_DAC8R1_SIZE                      equ 0001h
DAC8REF_DAC8R1_LENGTH                    equ 0001h
DAC8REF_DAC8R1_MASK                      equ 0002h
DAC8REF_DAC8R2_POSN                      equ 0002h
DAC8REF_DAC8R2_POSITION                  equ 0002h
DAC8REF_DAC8R2_SIZE                      equ 0001h
DAC8REF_DAC8R2_LENGTH                    equ 0001h
DAC8REF_DAC8R2_MASK                      equ 0004h
DAC8REF_DAC8R3_POSN                      equ 0003h
DAC8REF_DAC8R3_POSITION                  equ 0003h
DAC8REF_DAC8R3_SIZE                      equ 0001h
DAC8REF_DAC8R3_LENGTH                    equ 0001h
DAC8REF_DAC8R3_MASK                      equ 0008h
DAC8REF_DAC8R4_POSN                      equ 0004h
DAC8REF_DAC8R4_POSITION                  equ 0004h
DAC8REF_DAC8R4_SIZE                      equ 0001h
DAC8REF_DAC8R4_LENGTH                    equ 0001h
DAC8REF_DAC8R4_MASK                      equ 0010h
DAC8REF_REF0_POSN                        equ 0000h
DAC8REF_REF0_POSITION                    equ 0000h
DAC8REF_REF0_SIZE                        equ 0001h
DAC8REF_REF0_LENGTH                      equ 0001h
DAC8REF_REF0_MASK                        equ 0001h
DAC8REF_REF1_POSN                        equ 0001h
DAC8REF_REF1_POSITION                    equ 0001h
DAC8REF_REF1_SIZE                        equ 0001h
DAC8REF_REF1_LENGTH                      equ 0001h
DAC8REF_REF1_MASK                        equ 0002h
DAC8REF_REF2_POSN                        equ 0002h
DAC8REF_REF2_POSITION                    equ 0002h
DAC8REF_REF2_SIZE                        equ 0001h
DAC8REF_REF2_LENGTH                      equ 0001h
DAC8REF_REF2_MASK                        equ 0004h
DAC8REF_REF3_POSN                        equ 0003h
DAC8REF_REF3_POSITION                    equ 0003h
DAC8REF_REF3_SIZE                        equ 0001h
DAC8REF_REF3_LENGTH                      equ 0001h
DAC8REF_REF3_MASK                        equ 0008h
DAC8REF_REF4_POSN                        equ 0004h
DAC8REF_REF4_POSITION                    equ 0004h
DAC8REF_REF4_SIZE                        equ 0001h
DAC8REF_REF4_LENGTH                      equ 0001h
DAC8REF_REF4_MASK                        equ 0010h
DAC8REF_DAC8REF0_POSN                    equ 0000h
DAC8REF_DAC8REF0_POSITION                equ 0000h
DAC8REF_DAC8REF0_SIZE                    equ 0001h
DAC8REF_DAC8REF0_LENGTH                  equ 0001h
DAC8REF_DAC8REF0_MASK                    equ 0001h
DAC8REF_DAC8REF1_POSN                    equ 0001h
DAC8REF_DAC8REF1_POSITION                equ 0001h
DAC8REF_DAC8REF1_SIZE                    equ 0001h
DAC8REF_DAC8REF1_LENGTH                  equ 0001h
DAC8REF_DAC8REF1_MASK                    equ 0002h
DAC8REF_DAC8REF2_POSN                    equ 0002h
DAC8REF_DAC8REF2_POSITION                equ 0002h
DAC8REF_DAC8REF2_SIZE                    equ 0001h
DAC8REF_DAC8REF2_LENGTH                  equ 0001h
DAC8REF_DAC8REF2_MASK                    equ 0004h
DAC8REF_DAC8REF3_POSN                    equ 0003h
DAC8REF_DAC8REF3_POSITION                equ 0003h
DAC8REF_DAC8REF3_SIZE                    equ 0001h
DAC8REF_DAC8REF3_LENGTH                  equ 0001h
DAC8REF_DAC8REF3_MASK                    equ 0008h
DAC8REF_DAC8REF4_POSN                    equ 0004h
DAC8REF_DAC8REF4_POSITION                equ 0004h
DAC8REF_DAC8REF4_SIZE                    equ 0001h
DAC8REF_DAC8REF4_LENGTH                  equ 0001h
DAC8REF_DAC8REF4_MASK                    equ 0010h

// Register: PRG4RTSS
#define PRG4RTSS PRG4RTSS
PRG4RTSS                                 equ 060Eh
// bitfield definitions
PRG4RTSS_RTSS_POSN                       equ 0000h
PRG4RTSS_RTSS_POSITION                   equ 0000h
PRG4RTSS_RTSS_SIZE                       equ 0008h
PRG4RTSS_RTSS_LENGTH                     equ 0008h
PRG4RTSS_RTSS_MASK                       equ 00FFh
PRG4RTSS_RTSS0_POSN                      equ 0000h
PRG4RTSS_RTSS0_POSITION                  equ 0000h
PRG4RTSS_RTSS0_SIZE                      equ 0001h
PRG4RTSS_RTSS0_LENGTH                    equ 0001h
PRG4RTSS_RTSS0_MASK                      equ 0001h
PRG4RTSS_RTSS1_POSN                      equ 0001h
PRG4RTSS_RTSS1_POSITION                  equ 0001h
PRG4RTSS_RTSS1_SIZE                      equ 0001h
PRG4RTSS_RTSS1_LENGTH                    equ 0001h
PRG4RTSS_RTSS1_MASK                      equ 0002h
PRG4RTSS_RTSS2_POSN                      equ 0002h
PRG4RTSS_RTSS2_POSITION                  equ 0002h
PRG4RTSS_RTSS2_SIZE                      equ 0001h
PRG4RTSS_RTSS2_LENGTH                    equ 0001h
PRG4RTSS_RTSS2_MASK                      equ 0004h
PRG4RTSS_RTSS3_POSN                      equ 0003h
PRG4RTSS_RTSS3_POSITION                  equ 0003h
PRG4RTSS_RTSS3_SIZE                      equ 0001h
PRG4RTSS_RTSS3_LENGTH                    equ 0001h
PRG4RTSS_RTSS3_MASK                      equ 0008h
PRG4RTSS_RG4RTSS0_POSN                   equ 0000h
PRG4RTSS_RG4RTSS0_POSITION               equ 0000h
PRG4RTSS_RG4RTSS0_SIZE                   equ 0001h
PRG4RTSS_RG4RTSS0_LENGTH                 equ 0001h
PRG4RTSS_RG4RTSS0_MASK                   equ 0001h
PRG4RTSS_RG4RTSS1_POSN                   equ 0001h
PRG4RTSS_RG4RTSS1_POSITION               equ 0001h
PRG4RTSS_RG4RTSS1_SIZE                   equ 0001h
PRG4RTSS_RG4RTSS1_LENGTH                 equ 0001h
PRG4RTSS_RG4RTSS1_MASK                   equ 0002h
PRG4RTSS_RG4RTSS2_POSN                   equ 0002h
PRG4RTSS_RG4RTSS2_POSITION               equ 0002h
PRG4RTSS_RG4RTSS2_SIZE                   equ 0001h
PRG4RTSS_RG4RTSS2_LENGTH                 equ 0001h
PRG4RTSS_RG4RTSS2_MASK                   equ 0004h
PRG4RTSS_RG4RTSS3_POSN                   equ 0003h
PRG4RTSS_RG4RTSS3_POSITION               equ 0003h
PRG4RTSS_RG4RTSS3_SIZE                   equ 0001h
PRG4RTSS_RG4RTSS3_LENGTH                 equ 0001h
PRG4RTSS_RG4RTSS3_MASK                   equ 0008h

