GopalSaraf/Practicals/PSDL/include/proc/pic16lf1777.inc
// Register: COG2ASD0
#define COG2ASD0 COG2ASD0
COG2ASD0                                 equ 071Dh
// bitfield definitions
COG2ASD0_ASDAC_POSN                      equ 0002h
COG2ASD0_ASDAC_POSITION                  equ 0002h
COG2ASD0_ASDAC_SIZE                      equ 0002h
COG2ASD0_ASDAC_LENGTH                    equ 0002h
COG2ASD0_ASDAC_MASK                      equ 000Ch
COG2ASD0_ASDBD_POSN                      equ 0004h
COG2ASD0_ASDBD_POSITION                  equ 0004h
COG2ASD0_ASDBD_SIZE                      equ 0002h
COG2ASD0_ASDBD_LENGTH                    equ 0002h
COG2ASD0_ASDBD_MASK                      equ 0030h
COG2ASD0_ASREN_POSN                      equ 0006h
COG2ASD0_ASREN_POSITION                  equ 0006h
COG2ASD0_ASREN_SIZE                      equ 0001h
COG2ASD0_ASREN_LENGTH                    equ 0001h
COG2ASD0_ASREN_MASK                      equ 0040h
COG2ASD0_ASE_POSN                        equ 0007h
COG2ASD0_ASE_POSITION                    equ 0007h
COG2ASD0_ASE_SIZE                        equ 0001h
COG2ASD0_ASE_LENGTH                      equ 0001h
COG2ASD0_ASE_MASK                        equ 0080h
COG2ASD0_ASDAC0_POSN                     equ 0002h
COG2ASD0_ASDAC0_POSITION                 equ 0002h
COG2ASD0_ASDAC0_SIZE                     equ 0001h
COG2ASD0_ASDAC0_LENGTH                   equ 0001h
COG2ASD0_ASDAC0_MASK                     equ 0004h
COG2ASD0_ASDAC1_POSN                     equ 0003h
COG2ASD0_ASDAC1_POSITION                 equ 0003h
COG2ASD0_ASDAC1_SIZE                     equ 0001h
COG2ASD0_ASDAC1_LENGTH                   equ 0001h
COG2ASD0_ASDAC1_MASK                     equ 0008h
COG2ASD0_ASDBD0_POSN                     equ 0004h
COG2ASD0_ASDBD0_POSITION                 equ 0004h
COG2ASD0_ASDBD0_SIZE                     equ 0001h
COG2ASD0_ASDBD0_LENGTH                   equ 0001h
COG2ASD0_ASDBD0_MASK                     equ 0010h
COG2ASD0_ASDBD1_POSN                     equ 0005h
COG2ASD0_ASDBD1_POSITION                 equ 0005h
COG2ASD0_ASDBD1_SIZE                     equ 0001h
COG2ASD0_ASDBD1_LENGTH                   equ 0001h
COG2ASD0_ASDBD1_MASK                     equ 0020h
COG2ASD0_ARSEN_POSN                      equ 0006h
COG2ASD0_ARSEN_POSITION                  equ 0006h
COG2ASD0_ARSEN_SIZE                      equ 0001h
COG2ASD0_ARSEN_LENGTH                    equ 0001h
COG2ASD0_ARSEN_MASK                      equ 0040h
COG2ASD0_G2ASDAC_POSN                    equ 0002h
COG2ASD0_G2ASDAC_POSITION                equ 0002h
COG2ASD0_G2ASDAC_SIZE                    equ 0002h
COG2ASD0_G2ASDAC_LENGTH                  equ 0002h
COG2ASD0_G2ASDAC_MASK                    equ 000Ch
COG2ASD0_G2ASDBD_POSN                    equ 0004h
COG2ASD0_G2ASDBD_POSITION                equ 0004h
COG2ASD0_G2ASDBD_SIZE                    equ 0002h
COG2ASD0_G2ASDBD_LENGTH                  equ 0002h
COG2ASD0_G2ASDBD_MASK                    equ 0030h
COG2ASD0_G2ARSEN_POSN                    equ 0006h
COG2ASD0_G2ARSEN_POSITION                equ 0006h
COG2ASD0_G2ARSEN_SIZE                    equ 0001h
COG2ASD0_G2ARSEN_LENGTH                  equ 0001h
COG2ASD0_G2ARSEN_MASK                    equ 0040h
COG2ASD0_G2ASE_POSN                      equ 0007h
COG2ASD0_G2ASE_POSITION                  equ 0007h
COG2ASD0_G2ASE_SIZE                      equ 0001h
COG2ASD0_G2ASE_LENGTH                    equ 0001h
COG2ASD0_G2ASE_MASK                      equ 0080h
COG2ASD0_G2ASDAC0_POSN                   equ 0002h
COG2ASD0_G2ASDAC0_POSITION               equ 0002h
COG2ASD0_G2ASDAC0_SIZE                   equ 0001h
COG2ASD0_G2ASDAC0_LENGTH                 equ 0001h
COG2ASD0_G2ASDAC0_MASK                   equ 0004h
COG2ASD0_G2ASDAC1_POSN                   equ 0003h
COG2ASD0_G2ASDAC1_POSITION               equ 0003h
COG2ASD0_G2ASDAC1_SIZE                   equ 0001h
COG2ASD0_G2ASDAC1_LENGTH                 equ 0001h
COG2ASD0_G2ASDAC1_MASK                   equ 0008h
COG2ASD0_G2ASDBD0_POSN                   equ 0004h
COG2ASD0_G2ASDBD0_POSITION               equ 0004h
COG2ASD0_G2ASDBD0_SIZE                   equ 0001h
COG2ASD0_G2ASDBD0_LENGTH                 equ 0001h
COG2ASD0_G2ASDBD0_MASK                   equ 0010h
COG2ASD0_G2ASDBD1_POSN                   equ 0005h
COG2ASD0_G2ASDBD1_POSITION               equ 0005h
COG2ASD0_G2ASDBD1_SIZE                   equ 0001h
COG2ASD0_G2ASDBD1_LENGTH                 equ 0001h
COG2ASD0_G2ASDBD1_MASK                   equ 0020h
COG2ASD0_G2ASREN_POSN                    equ 0006h
COG2ASD0_G2ASREN_POSITION                equ 0006h
COG2ASD0_G2ASREN_SIZE                    equ 0001h
COG2ASD0_G2ASREN_LENGTH                  equ 0001h
COG2ASD0_G2ASREN_MASK                    equ 0040h

// Register: COG2ASD1
#define COG2ASD1 COG2ASD1
COG2ASD1                                 equ 071Eh
// bitfield definitions
COG2ASD1_AS0E_POSN                       equ 0000h
COG2ASD1_AS0E_POSITION                   equ 0000h
COG2ASD1_AS0E_SIZE                       equ 0001h
COG2ASD1_AS0E_LENGTH                     equ 0001h
COG2ASD1_AS0E_MASK                       equ 0001h
COG2ASD1_AS1E_POSN                       equ 0001h
COG2ASD1_AS1E_POSITION                   equ 0001h
COG2ASD1_AS1E_SIZE                       equ 0001h
COG2ASD1_AS1E_LENGTH                     equ 0001h
COG2ASD1_AS1E_MASK                       equ 0002h
COG2ASD1_AS2E_POSN                       equ 0002h
COG2ASD1_AS2E_POSITION                   equ 0002h
COG2ASD1_AS2E_SIZE                       equ 0001h
COG2ASD1_AS2E_LENGTH                     equ 0001h
COG2ASD1_AS2E_MASK                       equ 0004h
COG2ASD1_AS3E_POSN                       equ 0003h
COG2ASD1_AS3E_POSITION                   equ 0003h
COG2ASD1_AS3E_SIZE                       equ 0001h
COG2ASD1_AS3E_LENGTH                     equ 0001h
COG2ASD1_AS3E_MASK                       equ 0008h
COG2ASD1_AS4E_POSN                       equ 0004h
COG2ASD1_AS4E_POSITION                   equ 0004h
COG2ASD1_AS4E_SIZE                       equ 0001h
COG2ASD1_AS4E_LENGTH                     equ 0001h
COG2ASD1_AS4E_MASK                       equ 0010h
COG2ASD1_AS5E_POSN                       equ 0005h
COG2ASD1_AS5E_POSITION                   equ 0005h
COG2ASD1_AS5E_SIZE                       equ 0001h
COG2ASD1_AS5E_LENGTH                     equ 0001h
COG2ASD1_AS5E_MASK                       equ 0020h
COG2ASD1_AS6E_POSN                       equ 0006h
COG2ASD1_AS6E_POSITION                   equ 0006h
COG2ASD1_AS6E_SIZE                       equ 0001h
COG2ASD1_AS6E_LENGTH                     equ 0001h
COG2ASD1_AS6E_MASK                       equ 0040h
COG2ASD1_AS7E_POSN                       equ 0007h
COG2ASD1_AS7E_POSITION                   equ 0007h
COG2ASD1_AS7E_SIZE                       equ 0001h
COG2ASD1_AS7E_LENGTH                     equ 0001h
COG2ASD1_AS7E_MASK                       equ 0080h
COG2ASD1_G2AS0E_POSN                     equ 0000h
COG2ASD1_G2AS0E_POSITION                 equ 0000h
COG2ASD1_G2AS0E_SIZE                     equ 0001h
COG2ASD1_G2AS0E_LENGTH                   equ 0001h
COG2ASD1_G2AS0E_MASK                     equ 0001h
COG2ASD1_G2AS1E_POSN                     equ 0001h
COG2ASD1_G2AS1E_POSITION                 equ 0001h
COG2ASD1_G2AS1E_SIZE                     equ 0001h
COG2ASD1_G2AS1E_LENGTH                   equ 0001h
COG2ASD1_G2AS1E_MASK                     equ 0002h
COG2ASD1_G2AS2E_POSN                     equ 0002h
COG2ASD1_G2AS2E_POSITION                 equ 0002h
COG2ASD1_G2AS2E_SIZE                     equ 0001h
COG2ASD1_G2AS2E_LENGTH                   equ 0001h
COG2ASD1_G2AS2E_MASK                     equ 0004h
COG2ASD1_G2AS3E_POSN                     equ 0003h
COG2ASD1_G2AS3E_POSITION                 equ 0003h
COG2ASD1_G2AS3E_SIZE                     equ 0001h
COG2ASD1_G2AS3E_LENGTH                   equ 0001h
COG2ASD1_G2AS3E_MASK                     equ 0008h
COG2ASD1_G2AS4E_POSN                     equ 0004h
COG2ASD1_G2AS4E_POSITION                 equ 0004h
COG2ASD1_G2AS4E_SIZE                     equ 0001h
COG2ASD1_G2AS4E_LENGTH                   equ 0001h
COG2ASD1_G2AS4E_MASK                     equ 0010h
COG2ASD1_G2AS5E_POSN                     equ 0005h
COG2ASD1_G2AS5E_POSITION                 equ 0005h
COG2ASD1_G2AS5E_SIZE                     equ 0001h
COG2ASD1_G2AS5E_LENGTH                   equ 0001h
COG2ASD1_G2AS5E_MASK                     equ 0020h
COG2ASD1_G2AS6E_POSN                     equ 0006h
COG2ASD1_G2AS6E_POSITION                 equ 0006h
COG2ASD1_G2AS6E_SIZE                     equ 0001h
COG2ASD1_G2AS6E_LENGTH                   equ 0001h
COG2ASD1_G2AS6E_MASK                     equ 0040h
COG2ASD1_G2AS7E_POSN                     equ 0007h
COG2ASD1_G2AS7E_POSITION                 equ 0007h
COG2ASD1_G2AS7E_SIZE                     equ 0001h
COG2ASD1_G2AS7E_LENGTH                   equ 0001h
COG2ASD1_G2AS7E_MASK                     equ 0080h

// Register: COG2STR
#define COG2STR COG2STR
COG2STR                                  equ 071Fh
// bitfield definitions
COG2STR_STRA_POSN                        equ 0000h
COG2STR_STRA_POSITION                    equ 0000h
COG2STR_STRA_SIZE                        equ 0001h
COG2STR_STRA_LENGTH                      equ 0001h
COG2STR_STRA_MASK                        equ 0001h
COG2STR_STRB_POSN                        equ 0001h
COG2STR_STRB_POSITION                    equ 0001h
COG2STR_STRB_SIZE                        equ 0001h
COG2STR_STRB_LENGTH                      equ 0001h
COG2STR_STRB_MASK                        equ 0002h
COG2STR_STRC_POSN                        equ 0002h
COG2STR_STRC_POSITION                    equ 0002h
COG2STR_STRC_SIZE                        equ 0001h
COG2STR_STRC_LENGTH                      equ 0001h
COG2STR_STRC_MASK                        equ 0004h
COG2STR_STRD_POSN                        equ 0003h
COG2STR_STRD_POSITION                    equ 0003h
COG2STR_STRD_SIZE                        equ 0001h
COG2STR_STRD_LENGTH                      equ 0001h
COG2STR_STRD_MASK                        equ 0008h
COG2STR_SDATA_POSN                       equ 0004h
COG2STR_SDATA_POSITION                   equ 0004h
COG2STR_SDATA_SIZE                       equ 0001h
COG2STR_SDATA_LENGTH                     equ 0001h
COG2STR_SDATA_MASK                       equ 0010h
COG2STR_SDATB_POSN                       equ 0005h
COG2STR_SDATB_POSITION                   equ 0005h
COG2STR_SDATB_SIZE                       equ 0001h
COG2STR_SDATB_LENGTH                     equ 0001h
COG2STR_SDATB_MASK                       equ 0020h
COG2STR_SDATC_POSN                       equ 0006h
COG2STR_SDATC_POSITION                   equ 0006h
COG2STR_SDATC_SIZE                       equ 0001h
COG2STR_SDATC_LENGTH                     equ 0001h
COG2STR_SDATC_MASK                       equ 0040h
COG2STR_SDATD_POSN                       equ 0007h
COG2STR_SDATD_POSITION                   equ 0007h
COG2STR_SDATD_SIZE                       equ 0001h
COG2STR_SDATD_LENGTH                     equ 0001h
COG2STR_SDATD_MASK                       equ 0080h
COG2STR_G2STRA_POSN                      equ 0000h
COG2STR_G2STRA_POSITION                  equ 0000h
COG2STR_G2STRA_SIZE                      equ 0001h
COG2STR_G2STRA_LENGTH                    equ 0001h
COG2STR_G2STRA_MASK                      equ 0001h
COG2STR_G2STRB_POSN                      equ 0001h
COG2STR_G2STRB_POSITION                  equ 0001h
COG2STR_G2STRB_SIZE                      equ 0001h
COG2STR_G2STRB_LENGTH                    equ 0001h
COG2STR_G2STRB_MASK                      equ 0002h
COG2STR_G2STRC_POSN                      equ 0002h
COG2STR_G2STRC_POSITION                  equ 0002h
COG2STR_G2STRC_SIZE                      equ 0001h
COG2STR_G2STRC_LENGTH                    equ 0001h
COG2STR_G2STRC_MASK                      equ 0004h
COG2STR_G2STRD_POSN                      equ 0003h
COG2STR_G2STRD_POSITION                  equ 0003h
COG2STR_G2STRD_SIZE                      equ 0001h
COG2STR_G2STRD_LENGTH                    equ 0001h
COG2STR_G2STRD_MASK                      equ 0008h
COG2STR_G2SDATA_POSN                     equ 0004h
COG2STR_G2SDATA_POSITION                 equ 0004h
COG2STR_G2SDATA_SIZE                     equ 0001h
COG2STR_G2SDATA_LENGTH                   equ 0001h
COG2STR_G2SDATA_MASK                     equ 0010h
COG2STR_G2SDATB_POSN                     equ 0005h
COG2STR_G2SDATB_POSITION                 equ 0005h
COG2STR_G2SDATB_SIZE                     equ 0001h
COG2STR_G2SDATB_LENGTH                   equ 0001h
COG2STR_G2SDATB_MASK                     equ 0020h
COG2STR_G2SDATC_POSN                     equ 0006h
COG2STR_G2SDATC_POSITION                 equ 0006h
COG2STR_G2SDATC_SIZE                     equ 0001h
COG2STR_G2SDATC_LENGTH                   equ 0001h
COG2STR_G2SDATC_MASK                     equ 0040h
COG2STR_G2SDATD_POSN                     equ 0007h
COG2STR_G2SDATD_POSITION                 equ 0007h
COG2STR_G2SDATD_SIZE                     equ 0001h
COG2STR_G2SDATD_LENGTH                   equ 0001h
COG2STR_G2SDATD_MASK                     equ 0080h

// Register: PRG1RTSS
#define PRG1RTSS PRG1RTSS
PRG1RTSS                                 equ 078Eh
// bitfield definitions
PRG1RTSS_RTSS_POSN                       equ 0000h
PRG1RTSS_RTSS_POSITION                   equ 0000h
PRG1RTSS_RTSS_SIZE                       equ 0008h
PRG1RTSS_RTSS_LENGTH                     equ 0008h
PRG1RTSS_RTSS_MASK                       equ 00FFh
PRG1RTSS_RTSS0_POSN                      equ 0000h
PRG1RTSS_RTSS0_POSITION                  equ 0000h
PRG1RTSS_RTSS0_SIZE                      equ 0001h
PRG1RTSS_RTSS0_LENGTH                    equ 0001h
PRG1RTSS_RTSS0_MASK                      equ 0001h
PRG1RTSS_RTSS1_POSN                      equ 0001h
PRG1RTSS_RTSS1_POSITION                  equ 0001h
PRG1RTSS_RTSS1_SIZE                      equ 0001h
PRG1RTSS_RTSS1_LENGTH                    equ 0001h
PRG1RTSS_RTSS1_MASK                      equ 0002h
PRG1RTSS_RTSS2_POSN                      equ 0002h
PRG1RTSS_RTSS2_POSITION                  equ 0002h
PRG1RTSS_RTSS2_SIZE                      equ 0001h
PRG1RTSS_RTSS2_LENGTH                    equ 0001h
PRG1RTSS_RTSS2_MASK                      equ 0004h
PRG1RTSS_RTSS3_POSN                      equ 0003h
PRG1RTSS_RTSS3_POSITION                  equ 0003h
PRG1RTSS_RTSS3_SIZE                      equ 0001h
PRG1RTSS_RTSS3_LENGTH                    equ 0001h
PRG1RTSS_RTSS3_MASK                      equ 0008h
PRG1RTSS_RG1RTSS0_POSN                   equ 0000h
PRG1RTSS_RG1RTSS0_POSITION               equ 0000h
PRG1RTSS_RG1RTSS0_SIZE                   equ 0001h
PRG1RTSS_RG1RTSS0_LENGTH                 equ 0001h
PRG1RTSS_RG1RTSS0_MASK                   equ 0001h
PRG1RTSS_RG1RTSS1_POSN                   equ 0001h
PRG1RTSS_RG1RTSS1_POSITION               equ 0001h
PRG1RTSS_RG1RTSS1_SIZE                   equ 0001h
PRG1RTSS_RG1RTSS1_LENGTH                 equ 0001h
PRG1RTSS_RG1RTSS1_MASK                   equ 0002h
PRG1RTSS_RG1RTSS2_POSN                   equ 0002h
PRG1RTSS_RG1RTSS2_POSITION               equ 0002h
PRG1RTSS_RG1RTSS2_SIZE                   equ 0001h
PRG1RTSS_RG1RTSS2_LENGTH                 equ 0001h
PRG1RTSS_RG1RTSS2_MASK                   equ 0004h
PRG1RTSS_RG1RTSS3_POSN                   equ 0003h
PRG1RTSS_RG1RTSS3_POSITION               equ 0003h
PRG1RTSS_RG1RTSS3_SIZE                   equ 0001h
PRG1RTSS_RG1RTSS3_LENGTH                 equ 0001h
PRG1RTSS_RG1RTSS3_MASK                   equ 0008h

// Register: PRG1FTSS
#define PRG1FTSS PRG1FTSS
PRG1FTSS                                 equ 078Fh
// bitfield definitions
PRG1FTSS_FTSS_POSN                       equ 0000h
PRG1FTSS_FTSS_POSITION                   equ 0000h
PRG1FTSS_FTSS_SIZE                       equ 0008h
PRG1FTSS_FTSS_LENGTH                     equ 0008h
PRG1FTSS_FTSS_MASK                       equ 00FFh
PRG1FTSS_FTSS0_POSN                      equ 0000h
PRG1FTSS_FTSS0_POSITION                  equ 0000h
PRG1FTSS_FTSS0_SIZE                      equ 0001h
PRG1FTSS_FTSS0_LENGTH                    equ 0001h
PRG1FTSS_FTSS0_MASK                      equ 0001h
PRG1FTSS_FTSS1_POSN                      equ 0001h
PRG1FTSS_FTSS1_POSITION                  equ 0001h
PRG1FTSS_FTSS1_SIZE                      equ 0001h
PRG1FTSS_FTSS1_LENGTH                    equ 0001h
PRG1FTSS_FTSS1_MASK                      equ 0002h
PRG1FTSS_FTSS2_POSN                      equ 0002h
PRG1FTSS_FTSS2_POSITION                  equ 0002h
PRG1FTSS_FTSS2_SIZE                      equ 0001h
PRG1FTSS_FTSS2_LENGTH                    equ 0001h
PRG1FTSS_FTSS2_MASK                      equ 0004h
PRG1FTSS_FTSS3_POSN                      equ 0003h
PRG1FTSS_FTSS3_POSITION                  equ 0003h
PRG1FTSS_FTSS3_SIZE                      equ 0001h
PRG1FTSS_FTSS3_LENGTH                    equ 0001h
PRG1FTSS_FTSS3_MASK                      equ 0008h
PRG1FTSS_RG1FTSS0_POSN                   equ 0000h
PRG1FTSS_RG1FTSS0_POSITION               equ 0000h
PRG1FTSS_RG1FTSS0_SIZE                   equ 0001h
PRG1FTSS_RG1FTSS0_LENGTH                 equ 0001h
PRG1FTSS_RG1FTSS0_MASK                   equ 0001h
PRG1FTSS_RG1FTSS1_POSN                   equ 0001h
PRG1FTSS_RG1FTSS1_POSITION               equ 0001h
PRG1FTSS_RG1FTSS1_SIZE                   equ 0001h
PRG1FTSS_RG1FTSS1_LENGTH                 equ 0001h
PRG1FTSS_RG1FTSS1_MASK                   equ 0002h
PRG1FTSS_RG1FTSS2_POSN                   equ 0002h
PRG1FTSS_RG1FTSS2_POSITION               equ 0002h
PRG1FTSS_RG1FTSS2_SIZE                   equ 0001h
PRG1FTSS_RG1FTSS2_LENGTH                 equ 0001h
PRG1FTSS_RG1FTSS2_MASK                   equ 0004h
PRG1FTSS_RG1FTSS3_POSN                   equ 0003h
PRG1FTSS_RG1FTSS3_POSITION               equ 0003h
PRG1FTSS_RG1FTSS3_SIZE                   equ 0001h
PRG1FTSS_RG1FTSS3_LENGTH                 equ 0001h
PRG1FTSS_RG1FTSS3_MASK                   equ 0008h

// Register: PRG1INS
#define PRG1INS PRG1INS
PRG1INS                                  equ 0790h
// bitfield definitions
PRG1INS_INS_POSN                         equ 0000h
PRG1INS_INS_POSITION                     equ 0000h
PRG1INS_INS_SIZE                         equ 0008h
PRG1INS_INS_LENGTH                       equ 0008h
PRG1INS_INS_MASK                         equ 00FFh
PRG1INS_INS0_POSN                        equ 0000h
PRG1INS_INS0_POSITION                    equ 0000h
PRG1INS_INS0_SIZE                        equ 0001h
PRG1INS_INS0_LENGTH                      equ 0001h
PRG1INS_INS0_MASK                        equ 0001h
PRG1INS_INS1_POSN                        equ 0001h
PRG1INS_INS1_POSITION                    equ 0001h
PRG1INS_INS1_SIZE                        equ 0001h
PRG1INS_INS1_LENGTH                      equ 0001h
PRG1INS_INS1_MASK                        equ 0002h
PRG1INS_INS2_POSN                        equ 0002h
PRG1INS_INS2_POSITION                    equ 0002h
PRG1INS_INS2_SIZE                        equ 0001h
PRG1INS_INS2_LENGTH                      equ 0001h
PRG1INS_INS2_MASK                        equ 0004h
PRG1INS_INS3_POSN                        equ 0003h
PRG1INS_INS3_POSITION                    equ 0003h
PRG1INS_INS3_SIZE                        equ 0001h
PRG1INS_INS3_LENGTH                      equ 0001h
PRG1INS_INS3_MASK                        equ 0008h
PRG1INS_RG1INS0_POSN                     equ 0000h
PRG1INS_RG1INS0_POSITION                 equ 0000h
PRG1INS_RG1INS0_SIZE                     equ 0001h
PRG1INS_RG1INS0_LENGTH                   equ 0001h
PRG1INS_RG1INS0_MASK                     equ 0001h
PRG1INS_RG1INS1_POSN                     equ 0001h
PRG1INS_RG1INS1_POSITION                 equ 0001h
PRG1INS_RG1INS1_SIZE                     equ 0001h
PRG1INS_RG1INS1_LENGTH                   equ 0001h
PRG1INS_RG1INS1_MASK                     equ 0002h
PRG1INS_RG1INS2_POSN                     equ 0002h
PRG1INS_RG1INS2_POSITION                 equ 0002h
PRG1INS_RG1INS2_SIZE                     equ 0001h
PRG1INS_RG1INS2_LENGTH                   equ 0001h
PRG1INS_RG1INS2_MASK                     equ 0004h
PRG1INS_RG1INS3_POSN                     equ 0003h
PRG1INS_RG1INS3_POSITION                 equ 0003h
PRG1INS_RG1INS3_SIZE                     equ 0001h
PRG1INS_RG1INS3_LENGTH                   equ 0001h
PRG1INS_RG1INS3_MASK                     equ 0008h

