GopalSaraf/Practicals/PSDL/include/proc/pic16lf1777.inc
// Register: CM4PSEL
#define CM4PSEL CM4PSEL
CM4PSEL                                  equ 090Fh
// bitfield definitions
CM4PSEL_PCH_POSN                         equ 0000h
CM4PSEL_PCH_POSITION                     equ 0000h
CM4PSEL_PCH_SIZE                         equ 0004h
CM4PSEL_PCH_LENGTH                       equ 0004h
CM4PSEL_PCH_MASK                         equ 000Fh
CM4PSEL_PCH0_POSN                        equ 0000h
CM4PSEL_PCH0_POSITION                    equ 0000h
CM4PSEL_PCH0_SIZE                        equ 0001h
CM4PSEL_PCH0_LENGTH                      equ 0001h
CM4PSEL_PCH0_MASK                        equ 0001h
CM4PSEL_PCH1_POSN                        equ 0001h
CM4PSEL_PCH1_POSITION                    equ 0001h
CM4PSEL_PCH1_SIZE                        equ 0001h
CM4PSEL_PCH1_LENGTH                      equ 0001h
CM4PSEL_PCH1_MASK                        equ 0002h
CM4PSEL_PCH2_POSN                        equ 0002h
CM4PSEL_PCH2_POSITION                    equ 0002h
CM4PSEL_PCH2_SIZE                        equ 0001h
CM4PSEL_PCH2_LENGTH                      equ 0001h
CM4PSEL_PCH2_MASK                        equ 0004h
CM4PSEL_PCH3_POSN                        equ 0003h
CM4PSEL_PCH3_POSITION                    equ 0003h
CM4PSEL_PCH3_SIZE                        equ 0001h
CM4PSEL_PCH3_LENGTH                      equ 0001h
CM4PSEL_PCH3_MASK                        equ 0008h
CM4PSEL_C4PCH_POSN                       equ 0000h
CM4PSEL_C4PCH_POSITION                   equ 0000h
CM4PSEL_C4PCH_SIZE                       equ 0004h
CM4PSEL_C4PCH_LENGTH                     equ 0004h
CM4PSEL_C4PCH_MASK                       equ 000Fh
CM4PSEL_C4PCH0_POSN                      equ 0000h
CM4PSEL_C4PCH0_POSITION                  equ 0000h
CM4PSEL_C4PCH0_SIZE                      equ 0001h
CM4PSEL_C4PCH0_LENGTH                    equ 0001h
CM4PSEL_C4PCH0_MASK                      equ 0001h
CM4PSEL_C4PCH1_POSN                      equ 0001h
CM4PSEL_C4PCH1_POSITION                  equ 0001h
CM4PSEL_C4PCH1_SIZE                      equ 0001h
CM4PSEL_C4PCH1_LENGTH                    equ 0001h
CM4PSEL_C4PCH1_MASK                      equ 0002h
CM4PSEL_C4PCH2_POSN                      equ 0002h
CM4PSEL_C4PCH2_POSITION                  equ 0002h
CM4PSEL_C4PCH2_SIZE                      equ 0001h
CM4PSEL_C4PCH2_LENGTH                    equ 0001h
CM4PSEL_C4PCH2_MASK                      equ 0004h
CM4PSEL_C4PCH3_POSN                      equ 0003h
CM4PSEL_C4PCH3_POSITION                  equ 0003h
CM4PSEL_C4PCH3_SIZE                      equ 0001h
CM4PSEL_C4PCH3_LENGTH                    equ 0001h
CM4PSEL_C4PCH3_MASK                      equ 0008h

// Register: CM5CON0
#define CM5CON0 CM5CON0
CM5CON0                                  equ 0910h
// bitfield definitions
CM5CON0_SYNC_POSN                        equ 0000h
CM5CON0_SYNC_POSITION                    equ 0000h
CM5CON0_SYNC_SIZE                        equ 0001h
CM5CON0_SYNC_LENGTH                      equ 0001h
CM5CON0_SYNC_MASK                        equ 0001h
CM5CON0_HYS_POSN                         equ 0001h
CM5CON0_HYS_POSITION                     equ 0001h
CM5CON0_HYS_SIZE                         equ 0001h
CM5CON0_HYS_LENGTH                       equ 0001h
CM5CON0_HYS_MASK                         equ 0002h
CM5CON0_ZLF_POSN                         equ 0003h
CM5CON0_ZLF_POSITION                     equ 0003h
CM5CON0_ZLF_SIZE                         equ 0001h
CM5CON0_ZLF_LENGTH                       equ 0001h
CM5CON0_ZLF_MASK                         equ 0008h
CM5CON0_POL_POSN                         equ 0004h
CM5CON0_POL_POSITION                     equ 0004h
CM5CON0_POL_SIZE                         equ 0001h
CM5CON0_POL_LENGTH                       equ 0001h
CM5CON0_POL_MASK                         equ 0010h
CM5CON0_OUT_POSN                         equ 0006h
CM5CON0_OUT_POSITION                     equ 0006h
CM5CON0_OUT_SIZE                         equ 0001h
CM5CON0_OUT_LENGTH                       equ 0001h
CM5CON0_OUT_MASK                         equ 0040h
CM5CON0_ON_POSN                          equ 0007h
CM5CON0_ON_POSITION                      equ 0007h
CM5CON0_ON_SIZE                          equ 0001h
CM5CON0_ON_LENGTH                        equ 0001h
CM5CON0_ON_MASK                          equ 0080h
CM5CON0_C5SYNC_POSN                      equ 0000h
CM5CON0_C5SYNC_POSITION                  equ 0000h
CM5CON0_C5SYNC_SIZE                      equ 0001h
CM5CON0_C5SYNC_LENGTH                    equ 0001h
CM5CON0_C5SYNC_MASK                      equ 0001h
CM5CON0_C5HYS_POSN                       equ 0001h
CM5CON0_C5HYS_POSITION                   equ 0001h
CM5CON0_C5HYS_SIZE                       equ 0001h
CM5CON0_C5HYS_LENGTH                     equ 0001h
CM5CON0_C5HYS_MASK                       equ 0002h
CM5CON0_C5SP_POSN                        equ 0002h
CM5CON0_C5SP_POSITION                    equ 0002h
CM5CON0_C5SP_SIZE                        equ 0001h
CM5CON0_C5SP_LENGTH                      equ 0001h
CM5CON0_C5SP_MASK                        equ 0004h
CM5CON0_C5ZLF_POSN                       equ 0003h
CM5CON0_C5ZLF_POSITION                   equ 0003h
CM5CON0_C5ZLF_SIZE                       equ 0001h
CM5CON0_C5ZLF_LENGTH                     equ 0001h
CM5CON0_C5ZLF_MASK                       equ 0008h
CM5CON0_C5POL_POSN                       equ 0004h
CM5CON0_C5POL_POSITION                   equ 0004h
CM5CON0_C5POL_SIZE                       equ 0001h
CM5CON0_C5POL_LENGTH                     equ 0001h
CM5CON0_C5POL_MASK                       equ 0010h
CM5CON0_C5OUT_POSN                       equ 0006h
CM5CON0_C5OUT_POSITION                   equ 0006h
CM5CON0_C5OUT_SIZE                       equ 0001h
CM5CON0_C5OUT_LENGTH                     equ 0001h
CM5CON0_C5OUT_MASK                       equ 0040h
CM5CON0_C5ON_POSN                        equ 0007h
CM5CON0_C5ON_POSITION                    equ 0007h
CM5CON0_C5ON_SIZE                        equ 0001h
CM5CON0_C5ON_LENGTH                      equ 0001h
CM5CON0_C5ON_MASK                        equ 0080h

// Register: CM5CON1
#define CM5CON1 CM5CON1
CM5CON1                                  equ 0911h
// bitfield definitions
CM5CON1_INTN_POSN                        equ 0000h
CM5CON1_INTN_POSITION                    equ 0000h
CM5CON1_INTN_SIZE                        equ 0001h
CM5CON1_INTN_LENGTH                      equ 0001h
CM5CON1_INTN_MASK                        equ 0001h
CM5CON1_INTP_POSN                        equ 0001h
CM5CON1_INTP_POSITION                    equ 0001h
CM5CON1_INTP_SIZE                        equ 0001h
CM5CON1_INTP_LENGTH                      equ 0001h
CM5CON1_INTP_MASK                        equ 0002h
CM5CON1_C5INTN_POSN                      equ 0000h
CM5CON1_C5INTN_POSITION                  equ 0000h
CM5CON1_C5INTN_SIZE                      equ 0001h
CM5CON1_C5INTN_LENGTH                    equ 0001h
CM5CON1_C5INTN_MASK                      equ 0001h
CM5CON1_C5INTP_POSN                      equ 0001h
CM5CON1_C5INTP_POSITION                  equ 0001h
CM5CON1_C5INTP_SIZE                      equ 0001h
CM5CON1_C5INTP_LENGTH                    equ 0001h
CM5CON1_C5INTP_MASK                      equ 0002h

// Register: CM5NSEL
#define CM5NSEL CM5NSEL
CM5NSEL                                  equ 0912h
// bitfield definitions
CM5NSEL_NCH_POSN                         equ 0000h
CM5NSEL_NCH_POSITION                     equ 0000h
CM5NSEL_NCH_SIZE                         equ 0004h
CM5NSEL_NCH_LENGTH                       equ 0004h
CM5NSEL_NCH_MASK                         equ 000Fh
CM5NSEL_C5NCH_POSN                       equ 0000h
CM5NSEL_C5NCH_POSITION                   equ 0000h
CM5NSEL_C5NCH_SIZE                       equ 0004h
CM5NSEL_C5NCH_LENGTH                     equ 0004h
CM5NSEL_C5NCH_MASK                       equ 000Fh
CM5NSEL_C5NCH0_POSN                      equ 0000h
CM5NSEL_C5NCH0_POSITION                  equ 0000h
CM5NSEL_C5NCH0_SIZE                      equ 0001h
CM5NSEL_C5NCH0_LENGTH                    equ 0001h
CM5NSEL_C5NCH0_MASK                      equ 0001h
CM5NSEL_C5NCH1_POSN                      equ 0001h
CM5NSEL_C5NCH1_POSITION                  equ 0001h
CM5NSEL_C5NCH1_SIZE                      equ 0001h
CM5NSEL_C5NCH1_LENGTH                    equ 0001h
CM5NSEL_C5NCH1_MASK                      equ 0002h
CM5NSEL_C5NCH2_POSN                      equ 0002h
CM5NSEL_C5NCH2_POSITION                  equ 0002h
CM5NSEL_C5NCH2_SIZE                      equ 0001h
CM5NSEL_C5NCH2_LENGTH                    equ 0001h
CM5NSEL_C5NCH2_MASK                      equ 0004h
CM5NSEL_C5NCH3_POSN                      equ 0003h
CM5NSEL_C5NCH3_POSITION                  equ 0003h
CM5NSEL_C5NCH3_SIZE                      equ 0001h
CM5NSEL_C5NCH3_LENGTH                    equ 0001h
CM5NSEL_C5NCH3_MASK                      equ 0008h

// Register: CM5PSEL
#define CM5PSEL CM5PSEL
CM5PSEL                                  equ 0913h
// bitfield definitions
CM5PSEL_PCH_POSN                         equ 0000h
CM5PSEL_PCH_POSITION                     equ 0000h
CM5PSEL_PCH_SIZE                         equ 0004h
CM5PSEL_PCH_LENGTH                       equ 0004h
CM5PSEL_PCH_MASK                         equ 000Fh
CM5PSEL_PCH0_POSN                        equ 0000h
CM5PSEL_PCH0_POSITION                    equ 0000h
CM5PSEL_PCH0_SIZE                        equ 0001h
CM5PSEL_PCH0_LENGTH                      equ 0001h
CM5PSEL_PCH0_MASK                        equ 0001h
CM5PSEL_PCH1_POSN                        equ 0001h
CM5PSEL_PCH1_POSITION                    equ 0001h
CM5PSEL_PCH1_SIZE                        equ 0001h
CM5PSEL_PCH1_LENGTH                      equ 0001h
CM5PSEL_PCH1_MASK                        equ 0002h
CM5PSEL_PCH2_POSN                        equ 0002h
CM5PSEL_PCH2_POSITION                    equ 0002h
CM5PSEL_PCH2_SIZE                        equ 0001h
CM5PSEL_PCH2_LENGTH                      equ 0001h
CM5PSEL_PCH2_MASK                        equ 0004h
CM5PSEL_PCH3_POSN                        equ 0003h
CM5PSEL_PCH3_POSITION                    equ 0003h
CM5PSEL_PCH3_SIZE                        equ 0001h
CM5PSEL_PCH3_LENGTH                      equ 0001h
CM5PSEL_PCH3_MASK                        equ 0008h
CM5PSEL_C5PCH_POSN                       equ 0000h
CM5PSEL_C5PCH_POSITION                   equ 0000h
CM5PSEL_C5PCH_SIZE                       equ 0004h
CM5PSEL_C5PCH_LENGTH                     equ 0004h
CM5PSEL_C5PCH_MASK                       equ 000Fh
CM5PSEL_C5PCH0_POSN                      equ 0000h
CM5PSEL_C5PCH0_POSITION                  equ 0000h
CM5PSEL_C5PCH0_SIZE                      equ 0001h
CM5PSEL_C5PCH0_LENGTH                    equ 0001h
CM5PSEL_C5PCH0_MASK                      equ 0001h
CM5PSEL_C5PCH1_POSN                      equ 0001h
CM5PSEL_C5PCH1_POSITION                  equ 0001h
CM5PSEL_C5PCH1_SIZE                      equ 0001h
CM5PSEL_C5PCH1_LENGTH                    equ 0001h
CM5PSEL_C5PCH1_MASK                      equ 0002h
CM5PSEL_C5PCH2_POSN                      equ 0002h
CM5PSEL_C5PCH2_POSITION                  equ 0002h
CM5PSEL_C5PCH2_SIZE                      equ 0001h
CM5PSEL_C5PCH2_LENGTH                    equ 0001h
CM5PSEL_C5PCH2_MASK                      equ 0004h
CM5PSEL_C5PCH3_POSN                      equ 0003h
CM5PSEL_C5PCH3_POSITION                  equ 0003h
CM5PSEL_C5PCH3_SIZE                      equ 0001h
CM5PSEL_C5PCH3_LENGTH                    equ 0001h
CM5PSEL_C5PCH3_MASK                      equ 0008h

// Register: CM6CON0
#define CM6CON0 CM6CON0
CM6CON0                                  equ 0914h
// bitfield definitions
CM6CON0_SYNC_POSN                        equ 0000h
CM6CON0_SYNC_POSITION                    equ 0000h
CM6CON0_SYNC_SIZE                        equ 0001h
CM6CON0_SYNC_LENGTH                      equ 0001h
CM6CON0_SYNC_MASK                        equ 0001h
CM6CON0_HYS_POSN                         equ 0001h
CM6CON0_HYS_POSITION                     equ 0001h
CM6CON0_HYS_SIZE                         equ 0001h
CM6CON0_HYS_LENGTH                       equ 0001h
CM6CON0_HYS_MASK                         equ 0002h
CM6CON0_ZLF_POSN                         equ 0003h
CM6CON0_ZLF_POSITION                     equ 0003h
CM6CON0_ZLF_SIZE                         equ 0001h
CM6CON0_ZLF_LENGTH                       equ 0001h
CM6CON0_ZLF_MASK                         equ 0008h
CM6CON0_POL_POSN                         equ 0004h
CM6CON0_POL_POSITION                     equ 0004h
CM6CON0_POL_SIZE                         equ 0001h
CM6CON0_POL_LENGTH                       equ 0001h
CM6CON0_POL_MASK                         equ 0010h
CM6CON0_OUT_POSN                         equ 0006h
CM6CON0_OUT_POSITION                     equ 0006h
CM6CON0_OUT_SIZE                         equ 0001h
CM6CON0_OUT_LENGTH                       equ 0001h
CM6CON0_OUT_MASK                         equ 0040h
CM6CON0_ON_POSN                          equ 0007h
CM6CON0_ON_POSITION                      equ 0007h
CM6CON0_ON_SIZE                          equ 0001h
CM6CON0_ON_LENGTH                        equ 0001h
CM6CON0_ON_MASK                          equ 0080h
CM6CON0_C6SYNC_POSN                      equ 0000h
CM6CON0_C6SYNC_POSITION                  equ 0000h
CM6CON0_C6SYNC_SIZE                      equ 0001h
CM6CON0_C6SYNC_LENGTH                    equ 0001h
CM6CON0_C6SYNC_MASK                      equ 0001h
CM6CON0_C6HYS_POSN                       equ 0001h
CM6CON0_C6HYS_POSITION                   equ 0001h
CM6CON0_C6HYS_SIZE                       equ 0001h
CM6CON0_C6HYS_LENGTH                     equ 0001h
CM6CON0_C6HYS_MASK                       equ 0002h
CM6CON0_C6SP_POSN                        equ 0002h
CM6CON0_C6SP_POSITION                    equ 0002h
CM6CON0_C6SP_SIZE                        equ 0001h
CM6CON0_C6SP_LENGTH                      equ 0001h
CM6CON0_C6SP_MASK                        equ 0004h
CM6CON0_C6ZLF_POSN                       equ 0003h
CM6CON0_C6ZLF_POSITION                   equ 0003h
CM6CON0_C6ZLF_SIZE                       equ 0001h
CM6CON0_C6ZLF_LENGTH                     equ 0001h
CM6CON0_C6ZLF_MASK                       equ 0008h
CM6CON0_C6POL_POSN                       equ 0004h
CM6CON0_C6POL_POSITION                   equ 0004h
CM6CON0_C6POL_SIZE                       equ 0001h
CM6CON0_C6POL_LENGTH                     equ 0001h
CM6CON0_C6POL_MASK                       equ 0010h
CM6CON0_C6OUT_POSN                       equ 0006h
CM6CON0_C6OUT_POSITION                   equ 0006h
CM6CON0_C6OUT_SIZE                       equ 0001h
CM6CON0_C6OUT_LENGTH                     equ 0001h
CM6CON0_C6OUT_MASK                       equ 0040h
CM6CON0_C6ON_POSN                        equ 0007h
CM6CON0_C6ON_POSITION                    equ 0007h
CM6CON0_C6ON_SIZE                        equ 0001h
CM6CON0_C6ON_LENGTH                      equ 0001h
CM6CON0_C6ON_MASK                        equ 0080h

// Register: CM6CON1
#define CM6CON1 CM6CON1
CM6CON1                                  equ 0915h
// bitfield definitions
CM6CON1_INTN_POSN                        equ 0000h
CM6CON1_INTN_POSITION                    equ 0000h
CM6CON1_INTN_SIZE                        equ 0001h
CM6CON1_INTN_LENGTH                      equ 0001h
CM6CON1_INTN_MASK                        equ 0001h
CM6CON1_INTP_POSN                        equ 0001h
CM6CON1_INTP_POSITION                    equ 0001h
CM6CON1_INTP_SIZE                        equ 0001h
CM6CON1_INTP_LENGTH                      equ 0001h
CM6CON1_INTP_MASK                        equ 0002h
CM6CON1_C6INTN_POSN                      equ 0000h
CM6CON1_C6INTN_POSITION                  equ 0000h
CM6CON1_C6INTN_SIZE                      equ 0001h
CM6CON1_C6INTN_LENGTH                    equ 0001h
CM6CON1_C6INTN_MASK                      equ 0001h
CM6CON1_C6INTP_POSN                      equ 0001h
CM6CON1_C6INTP_POSITION                  equ 0001h
CM6CON1_C6INTP_SIZE                      equ 0001h
CM6CON1_C6INTP_LENGTH                    equ 0001h
CM6CON1_C6INTP_MASK                      equ 0002h

// Register: CM6NSEL
#define CM6NSEL CM6NSEL
CM6NSEL                                  equ 0916h
// bitfield definitions
CM6NSEL_NCH_POSN                         equ 0000h
CM6NSEL_NCH_POSITION                     equ 0000h
CM6NSEL_NCH_SIZE                         equ 0004h
CM6NSEL_NCH_LENGTH                       equ 0004h
CM6NSEL_NCH_MASK                         equ 000Fh
CM6NSEL_C6NCH_POSN                       equ 0000h
CM6NSEL_C6NCH_POSITION                   equ 0000h
CM6NSEL_C6NCH_SIZE                       equ 0004h
CM6NSEL_C6NCH_LENGTH                     equ 0004h
CM6NSEL_C6NCH_MASK                       equ 000Fh
CM6NSEL_C6NCH0_POSN                      equ 0000h
CM6NSEL_C6NCH0_POSITION                  equ 0000h
CM6NSEL_C6NCH0_SIZE                      equ 0001h
CM6NSEL_C6NCH0_LENGTH                    equ 0001h
CM6NSEL_C6NCH0_MASK                      equ 0001h
CM6NSEL_C6NCH1_POSN                      equ 0001h
CM6NSEL_C6NCH1_POSITION                  equ 0001h
CM6NSEL_C6NCH1_SIZE                      equ 0001h
CM6NSEL_C6NCH1_LENGTH                    equ 0001h
CM6NSEL_C6NCH1_MASK                      equ 0002h
CM6NSEL_C6NCH2_POSN                      equ 0002h
CM6NSEL_C6NCH2_POSITION                  equ 0002h
CM6NSEL_C6NCH2_SIZE                      equ 0001h
CM6NSEL_C6NCH2_LENGTH                    equ 0001h
CM6NSEL_C6NCH2_MASK                      equ 0004h
CM6NSEL_C6NCH3_POSN                      equ 0003h
CM6NSEL_C6NCH3_POSITION                  equ 0003h
CM6NSEL_C6NCH3_SIZE                      equ 0001h
CM6NSEL_C6NCH3_LENGTH                    equ 0001h
CM6NSEL_C6NCH3_MASK                      equ 0008h

// Register: CM6PSEL
#define CM6PSEL CM6PSEL
CM6PSEL                                  equ 0917h
// bitfield definitions
CM6PSEL_PCH_POSN                         equ 0000h
CM6PSEL_PCH_POSITION                     equ 0000h
CM6PSEL_PCH_SIZE                         equ 0004h
CM6PSEL_PCH_LENGTH                       equ 0004h
CM6PSEL_PCH_MASK                         equ 000Fh
CM6PSEL_PCH0_POSN                        equ 0000h
CM6PSEL_PCH0_POSITION                    equ 0000h
CM6PSEL_PCH0_SIZE                        equ 0001h
CM6PSEL_PCH0_LENGTH                      equ 0001h
CM6PSEL_PCH0_MASK                        equ 0001h
CM6PSEL_PCH1_POSN                        equ 0001h
CM6PSEL_PCH1_POSITION                    equ 0001h
CM6PSEL_PCH1_SIZE                        equ 0001h
CM6PSEL_PCH1_LENGTH                      equ 0001h
CM6PSEL_PCH1_MASK                        equ 0002h
CM6PSEL_PCH2_POSN                        equ 0002h
CM6PSEL_PCH2_POSITION                    equ 0002h
CM6PSEL_PCH2_SIZE                        equ 0001h
CM6PSEL_PCH2_LENGTH                      equ 0001h
CM6PSEL_PCH2_MASK                        equ 0004h
CM6PSEL_PCH3_POSN                        equ 0003h
CM6PSEL_PCH3_POSITION                    equ 0003h
CM6PSEL_PCH3_SIZE                        equ 0001h
CM6PSEL_PCH3_LENGTH                      equ 0001h
CM6PSEL_PCH3_MASK                        equ 0008h
CM6PSEL_C6PCH_POSN                       equ 0000h
CM6PSEL_C6PCH_POSITION                   equ 0000h
CM6PSEL_C6PCH_SIZE                       equ 0004h
CM6PSEL_C6PCH_LENGTH                     equ 0004h
CM6PSEL_C6PCH_MASK                       equ 000Fh
CM6PSEL_C6PCH0_POSN                      equ 0000h
CM6PSEL_C6PCH0_POSITION                  equ 0000h
CM6PSEL_C6PCH0_SIZE                      equ 0001h
CM6PSEL_C6PCH0_LENGTH                    equ 0001h
CM6PSEL_C6PCH0_MASK                      equ 0001h
CM6PSEL_C6PCH1_POSN                      equ 0001h
CM6PSEL_C6PCH1_POSITION                  equ 0001h
CM6PSEL_C6PCH1_SIZE                      equ 0001h
CM6PSEL_C6PCH1_LENGTH                    equ 0001h
CM6PSEL_C6PCH1_MASK                      equ 0002h
CM6PSEL_C6PCH2_POSN                      equ 0002h
CM6PSEL_C6PCH2_POSITION                  equ 0002h
CM6PSEL_C6PCH2_SIZE                      equ 0001h
CM6PSEL_C6PCH2_LENGTH                    equ 0001h
CM6PSEL_C6PCH2_MASK                      equ 0004h
CM6PSEL_C6PCH3_POSN                      equ 0003h
CM6PSEL_C6PCH3_POSITION                  equ 0003h
CM6PSEL_C6PCH3_SIZE                      equ 0001h
CM6PSEL_C6PCH3_LENGTH                    equ 0001h
CM6PSEL_C6PCH3_MASK                      equ 0008h

// Register: CM7CON0
#define CM7CON0 CM7CON0
CM7CON0                                  equ 0918h
// bitfield definitions
CM7CON0_SYNC_POSN                        equ 0000h
CM7CON0_SYNC_POSITION                    equ 0000h
CM7CON0_SYNC_SIZE                        equ 0001h
CM7CON0_SYNC_LENGTH                      equ 0001h
CM7CON0_SYNC_MASK                        equ 0001h
CM7CON0_HYS_POSN                         equ 0001h
CM7CON0_HYS_POSITION                     equ 0001h
CM7CON0_HYS_SIZE                         equ 0001h
CM7CON0_HYS_LENGTH                       equ 0001h
CM7CON0_HYS_MASK                         equ 0002h
CM7CON0_ZLF_POSN                         equ 0003h
CM7CON0_ZLF_POSITION                     equ 0003h
CM7CON0_ZLF_SIZE                         equ 0001h
CM7CON0_ZLF_LENGTH                       equ 0001h
CM7CON0_ZLF_MASK                         equ 0008h
CM7CON0_POL_POSN                         equ 0004h
CM7CON0_POL_POSITION                     equ 0004h
CM7CON0_POL_SIZE                         equ 0001h
CM7CON0_POL_LENGTH                       equ 0001h
CM7CON0_POL_MASK                         equ 0010h
CM7CON0_OUT_POSN                         equ 0006h
CM7CON0_OUT_POSITION                     equ 0006h
CM7CON0_OUT_SIZE                         equ 0001h
CM7CON0_OUT_LENGTH                       equ 0001h
CM7CON0_OUT_MASK                         equ 0040h
CM7CON0_ON_POSN                          equ 0007h
CM7CON0_ON_POSITION                      equ 0007h
CM7CON0_ON_SIZE                          equ 0001h
CM7CON0_ON_LENGTH                        equ 0001h
CM7CON0_ON_MASK                          equ 0080h
CM7CON0_C7SYNC_POSN                      equ 0000h
CM7CON0_C7SYNC_POSITION                  equ 0000h
CM7CON0_C7SYNC_SIZE                      equ 0001h
CM7CON0_C7SYNC_LENGTH                    equ 0001h
CM7CON0_C7SYNC_MASK                      equ 0001h
CM7CON0_C7HYS_POSN                       equ 0001h
CM7CON0_C7HYS_POSITION                   equ 0001h
CM7CON0_C7HYS_SIZE                       equ 0001h
CM7CON0_C7HYS_LENGTH                     equ 0001h
CM7CON0_C7HYS_MASK                       equ 0002h
CM7CON0_C7SP_POSN                        equ 0002h
CM7CON0_C7SP_POSITION                    equ 0002h
CM7CON0_C7SP_SIZE                        equ 0001h
CM7CON0_C7SP_LENGTH                      equ 0001h
CM7CON0_C7SP_MASK                        equ 0004h
CM7CON0_C7ZLF_POSN                       equ 0003h
CM7CON0_C7ZLF_POSITION                   equ 0003h
CM7CON0_C7ZLF_SIZE                       equ 0001h
CM7CON0_C7ZLF_LENGTH                     equ 0001h
CM7CON0_C7ZLF_MASK                       equ 0008h
CM7CON0_C7POL_POSN                       equ 0004h
CM7CON0_C7POL_POSITION                   equ 0004h
CM7CON0_C7POL_SIZE                       equ 0001h
CM7CON0_C7POL_LENGTH                     equ 0001h
CM7CON0_C7POL_MASK                       equ 0010h
CM7CON0_C7OUT_POSN                       equ 0006h
CM7CON0_C7OUT_POSITION                   equ 0006h
CM7CON0_C7OUT_SIZE                       equ 0001h
CM7CON0_C7OUT_LENGTH                     equ 0001h
CM7CON0_C7OUT_MASK                       equ 0040h
CM7CON0_C7ON_POSN                        equ 0007h
CM7CON0_C7ON_POSITION                    equ 0007h
CM7CON0_C7ON_SIZE                        equ 0001h
CM7CON0_C7ON_LENGTH                      equ 0001h
CM7CON0_C7ON_MASK                        equ 0080h

