GopalSaraf/Practicals/PSDL/include/proc/pic16lf1777.inc
#define G2FSIM8                          BANKMASK(COG2FSIM1), 0
#define G2FSIM9                          BANKMASK(COG2FSIM1), 1
#define G2LD                             BANKMASK(COG2CON0), 6
#define G2MD0                            BANKMASK(COG2CON0), 0
#define G2MD1                            BANKMASK(COG2CON0), 1
#define G2MD2                            BANKMASK(COG2CON0), 2
#define G2PHF0                           BANKMASK(COG2PHF), 0
#define G2PHF1                           BANKMASK(COG2PHF), 1
#define G2PHF2                           BANKMASK(COG2PHF), 2
#define G2PHF3                           BANKMASK(COG2PHF), 3
#define G2PHF4                           BANKMASK(COG2PHF), 4
#define G2PHF5                           BANKMASK(COG2PHF), 5
#define G2PHR0                           BANKMASK(COG2PHR), 0
#define G2PHR1                           BANKMASK(COG2PHR), 1
#define G2PHR2                           BANKMASK(COG2PHR), 2
#define G2PHR3                           BANKMASK(COG2PHR), 3
#define G2PHR4                           BANKMASK(COG2PHR), 4
#define G2PHR5                           BANKMASK(COG2PHR), 5
#define G2POLA                           BANKMASK(COG2CON1), 0
#define G2POLB                           BANKMASK(COG2CON1), 1
#define G2POLC                           BANKMASK(COG2CON1), 2
#define G2POLD                           BANKMASK(COG2CON1), 3
#define G2RDBS                           BANKMASK(COG2CON1), 7
#define G2RIS0                           BANKMASK(COG2RIS0), 0
#define G2RIS1                           BANKMASK(COG2RIS0), 1
#define G2RIS10                          BANKMASK(COG2RIS1), 2
#define G2RIS11                          BANKMASK(COG2RIS1), 3
#define G2RIS12                          BANKMASK(COG2RIS1), 4
#define G2RIS13                          BANKMASK(COG2RIS1), 5
#define G2RIS14                          BANKMASK(COG2RIS1), 6
#define G2RIS15                          BANKMASK(COG2RIS1), 7
#define G2RIS2                           BANKMASK(COG2RIS0), 2
#define G2RIS3                           BANKMASK(COG2RIS0), 3
#define G2RIS4                           BANKMASK(COG2RIS0), 4
#define G2RIS5                           BANKMASK(COG2RIS0), 5
#define G2RIS6                           BANKMASK(COG2RIS0), 6
#define G2RIS7                           BANKMASK(COG2RIS0), 7
#define G2RIS8                           BANKMASK(COG2RIS1), 0
#define G2RIS9                           BANKMASK(COG2RIS1), 1
#define G2RSIM0                          BANKMASK(COG2RSIM0), 0
#define G2RSIM1                          BANKMASK(COG2RSIM0), 1
#define G2RSIM10                         BANKMASK(COG2RSIM1), 2
#define G2RSIM11                         BANKMASK(COG2RSIM1), 3
#define G2RSIM12                         BANKMASK(COG2RSIM1), 4
#define G2RSIM13                         BANKMASK(COG2RSIM1), 5
#define G2RSIM14                         BANKMASK(COG2RSIM1), 6
#define G2RSIM15                         BANKMASK(COG2RSIM1), 7
#define G2RSIM2                          BANKMASK(COG2RSIM0), 2
#define G2RSIM3                          BANKMASK(COG2RSIM0), 3
#define G2RSIM4                          BANKMASK(COG2RSIM0), 4
#define G2RSIM5                          BANKMASK(COG2RSIM0), 5
#define G2RSIM6                          BANKMASK(COG2RSIM0), 6
#define G2RSIM7                          BANKMASK(COG2RSIM0), 7
#define G2RSIM8                          BANKMASK(COG2RSIM1), 0
#define G2RSIM9                          BANKMASK(COG2RSIM1), 1
#define G2SDATA                          BANKMASK(COG2STR), 4
#define G2SDATB                          BANKMASK(COG2STR), 5
#define G2SDATC                          BANKMASK(COG2STR), 6
#define G2SDATD                          BANKMASK(COG2STR), 7
#define G2STRA                           BANKMASK(COG2STR), 0
#define G2STRB                           BANKMASK(COG2STR), 1
#define G2STRC                           BANKMASK(COG2STR), 2
#define G2STRD                           BANKMASK(COG2STR), 3
#define G3ARSEN                          BANKMASK(COG3ASD0), 6
#define G3AS0E                           BANKMASK(COG3ASD1), 0
#define G3AS1E                           BANKMASK(COG3ASD1), 1
#define G3AS2E                           BANKMASK(COG3ASD1), 2
#define G3AS3E                           BANKMASK(COG3ASD1), 3
#define G3AS4E                           BANKMASK(COG3ASD1), 4
#define G3AS5E                           BANKMASK(COG3ASD1), 5
#define G3AS6E                           BANKMASK(COG3ASD1), 6
#define G3AS7E                           BANKMASK(COG3ASD1), 7
#define G3ASDAC0                         BANKMASK(COG3ASD0), 2
#define G3ASDAC1                         BANKMASK(COG3ASD0), 3
#define G3ASDBD0                         BANKMASK(COG3ASD0), 4
#define G3ASDBD1                         BANKMASK(COG3ASD0), 5
#define G3ASE                            BANKMASK(COG3ASD0), 7
#define G3ASREN                          BANKMASK(COG3ASD0), 6
#define G3BLKF0                          BANKMASK(COG3BLKF), 0
#define G3BLKF1                          BANKMASK(COG3BLKF), 1
#define G3BLKF2                          BANKMASK(COG3BLKF), 2
#define G3BLKF3                          BANKMASK(COG3BLKF), 3
#define G3BLKF4                          BANKMASK(COG3BLKF), 4
#define G3BLKF5                          BANKMASK(COG3BLKF), 5
#define G3BLKR0                          BANKMASK(COG3BLKR), 0
#define G3BLKR1                          BANKMASK(COG3BLKR), 1
#define G3BLKR2                          BANKMASK(COG3BLKR), 2
#define G3BLKR3                          BANKMASK(COG3BLKR), 3
#define G3BLKR4                          BANKMASK(COG3BLKR), 4
#define G3BLKR5                          BANKMASK(COG3BLKR), 5
#define G3CS0                            BANKMASK(COG3CON0), 3
#define G3CS1                            BANKMASK(COG3CON0), 4
#define G3DBF0                           BANKMASK(COG3DBF), 0
#define G3DBF1                           BANKMASK(COG3DBF), 1
#define G3DBF2                           BANKMASK(COG3DBF), 2
#define G3DBF3                           BANKMASK(COG3DBF), 3
#define G3DBF4                           BANKMASK(COG3DBF), 4
#define G3DBF5                           BANKMASK(COG3DBF), 5
#define G3DBR0                           BANKMASK(COG3DBR), 0
#define G3DBR1                           BANKMASK(COG3DBR), 1
#define G3DBR2                           BANKMASK(COG3DBR), 2
#define G3DBR3                           BANKMASK(COG3DBR), 3
#define G3DBR4                           BANKMASK(COG3DBR), 4
#define G3DBR5                           BANKMASK(COG3DBR), 5
#define G3EN                             BANKMASK(COG3CON0), 7
#define G3FDBS                           BANKMASK(COG3CON1), 6
#define G3FIS0                           BANKMASK(COG3FIS0), 0
#define G3FIS1                           BANKMASK(COG3FIS0), 1
#define G3FIS11                          BANKMASK(COG3FIS1), 3
#define G3FIS12                          BANKMASK(COG3FIS1), 4
#define G3FIS13                          BANKMASK(COG3FIS1), 5
#define G3FIS14                          BANKMASK(COG3FIS1), 6
#define G3FIS15                          BANKMASK(COG3FIS1), 7
#define G3FIS2                           BANKMASK(COG3FIS0), 2
#define G3FIS3                           BANKMASK(COG3FIS0), 3
#define G3FIS4                           BANKMASK(COG3FIS0), 4
#define G3FIS5                           BANKMASK(COG3FIS0), 5
#define G3FIS6                           BANKMASK(COG3FIS0), 6
#define G3FIS7                           BANKMASK(COG3FIS0), 7
#define G3FIS9                           BANKMASK(COG3FIS1), 1
#define G3FSIM0                          BANKMASK(COG3FSIM0), 0
#define G3FSIM1                          BANKMASK(COG3FSIM0), 1
#define G3FSIM11                         BANKMASK(COG3FSIM1), 3
#define G3FSIM12                         BANKMASK(COG3FSIM1), 4
#define G3FSIM13                         BANKMASK(COG3FSIM1), 5
#define G3FSIM14                         BANKMASK(COG3FSIM1), 6
#define G3FSIM15                         BANKMASK(COG3FSIM1), 7
#define G3FSIM2                          BANKMASK(COG3FSIM0), 2
#define G3FSIM3                          BANKMASK(COG3FSIM0), 3
#define G3FSIM4                          BANKMASK(COG3FSIM0), 4
#define G3FSIM5                          BANKMASK(COG3FSIM0), 5
#define G3FSIM6                          BANKMASK(COG3FSIM0), 6
#define G3FSIM7                          BANKMASK(COG3FSIM0), 7
#define G3FSIM9                          BANKMASK(COG3FSIM1), 1
#define G3LD                             BANKMASK(COG3CON0), 6
#define G3MD0                            BANKMASK(COG3CON0), 0
#define G3MD1                            BANKMASK(COG3CON0), 1
#define G3MD2                            BANKMASK(COG3CON0), 2
#define G3PHF0                           BANKMASK(COG3PHF), 0
#define G3PHF1                           BANKMASK(COG3PHF), 1
#define G3PHF2                           BANKMASK(COG3PHF), 2
#define G3PHF3                           BANKMASK(COG3PHF), 3
#define G3PHF4                           BANKMASK(COG3PHF), 4
#define G3PHF5                           BANKMASK(COG3PHF), 5
#define G3PHR0                           BANKMASK(COG3PHR), 0
#define G3PHR1                           BANKMASK(COG3PHR), 1
#define G3PHR2                           BANKMASK(COG3PHR), 2
#define G3PHR3                           BANKMASK(COG3PHR), 3
#define G3PHR4                           BANKMASK(COG3PHR), 4
#define G3PHR5                           BANKMASK(COG3PHR), 5
#define G3POLA                           BANKMASK(COG3CON1), 0
#define G3POLB                           BANKMASK(COG3CON1), 1
#define G3POLC                           BANKMASK(COG3CON1), 2
#define G3POLD                           BANKMASK(COG3CON1), 3
#define G3RDBS                           BANKMASK(COG3CON1), 7
#define G3RIS0                           BANKMASK(COG3RIS0), 0
#define G3RIS1                           BANKMASK(COG3RIS0), 1
#define G3RIS11                          BANKMASK(COG3RIS1), 3
#define G3RIS12                          BANKMASK(COG3RIS1), 4
#define G3RIS13                          BANKMASK(COG3RIS1), 5
#define G3RIS14                          BANKMASK(COG3RIS1), 6
#define G3RIS15                          BANKMASK(COG3RIS1), 7
#define G3RIS2                           BANKMASK(COG3RIS0), 2
#define G3RIS3                           BANKMASK(COG3RIS0), 3
#define G3RIS4                           BANKMASK(COG3RIS0), 4
#define G3RIS5                           BANKMASK(COG3RIS0), 5
#define G3RIS6                           BANKMASK(COG3RIS0), 6
#define G3RIS7                           BANKMASK(COG3RIS0), 7
#define G3RIS9                           BANKMASK(COG3RIS1), 1
#define G3RSIM0                          BANKMASK(COG3RSIM0), 0
#define G3RSIM1                          BANKMASK(COG3RSIM0), 1
#define G3RSIM11                         BANKMASK(COG3RSIM1), 3
#define G3RSIM12                         BANKMASK(COG3RSIM1), 4
#define G3RSIM13                         BANKMASK(COG3RSIM1), 5
#define G3RSIM14                         BANKMASK(COG3RSIM1), 6
#define G3RSIM15                         BANKMASK(COG3RSIM1), 7
#define G3RSIM2                          BANKMASK(COG3RSIM0), 2
#define G3RSIM3                          BANKMASK(COG3RSIM0), 3
#define G3RSIM4                          BANKMASK(COG3RSIM0), 4
#define G3RSIM5                          BANKMASK(COG3RSIM0), 5
#define G3RSIM6                          BANKMASK(COG3RSIM0), 6
#define G3RSIM7                          BANKMASK(COG3RSIM0), 7
#define G3RSIM9                          BANKMASK(COG3RSIM1), 1
#define G3SDATA                          BANKMASK(COG3STR), 4
#define G3SDATB                          BANKMASK(COG3STR), 5
#define G3SDATC                          BANKMASK(COG3STR), 6
#define G3SDATD                          BANKMASK(COG3STR), 7
#define G3STRA                           BANKMASK(COG3STR), 0
#define G3STRB                           BANKMASK(COG3STR), 1
#define G3STRC                           BANKMASK(COG3STR), 2
#define G3STRD                           BANKMASK(COG3STR), 3
#define G4ARSEN                          BANKMASK(COG4ASD0), 6
#define G4AS0E                           BANKMASK(COG4ASD1), 0
#define G4AS1E                           BANKMASK(COG4ASD1), 1
#define G4AS2E                           BANKMASK(COG4ASD1), 2
#define G4AS3E                           BANKMASK(COG4ASD1), 3
#define G4AS4E                           BANKMASK(COG4ASD1), 4
#define G4AS5E                           BANKMASK(COG4ASD1), 5
#define G4AS6E                           BANKMASK(COG4ASD1), 6
#define G4AS7E                           BANKMASK(COG4ASD1), 7
#define G4ASDAC0                         BANKMASK(COG4ASD0), 2
#define G4ASDAC1                         BANKMASK(COG4ASD0), 3
#define G4ASDBD0                         BANKMASK(COG4ASD0), 4
#define G4ASDBD1                         BANKMASK(COG4ASD0), 5
#define G4ASE                            BANKMASK(COG4ASD0), 7
#define G4ASREN                          BANKMASK(COG4ASD0), 6
#define G4BLKF0                          BANKMASK(COG4BLKF), 0
#define G4BLKF1                          BANKMASK(COG4BLKF), 1
#define G4BLKF2                          BANKMASK(COG4BLKF), 2
#define G4BLKF3                          BANKMASK(COG4BLKF), 3
#define G4BLKF4                          BANKMASK(COG4BLKF), 4
#define G4BLKF5                          BANKMASK(COG4BLKF), 5
#define G4BLKR0                          BANKMASK(COG4BLKR), 0
#define G4BLKR1                          BANKMASK(COG4BLKR), 1
#define G4BLKR2                          BANKMASK(COG4BLKR), 2
#define G4BLKR3                          BANKMASK(COG4BLKR), 3
#define G4BLKR4                          BANKMASK(COG4BLKR), 4
#define G4BLKR5                          BANKMASK(COG4BLKR), 5
#define G4CS0                            BANKMASK(COG4CON0), 3
#define G4CS1                            BANKMASK(COG4CON0), 4
#define G4DBF0                           BANKMASK(COG4DBF), 0
#define G4DBF1                           BANKMASK(COG4DBF), 1
#define G4DBF2                           BANKMASK(COG4DBF), 2
#define G4DBF3                           BANKMASK(COG4DBF), 3
#define G4DBF4                           BANKMASK(COG4DBF), 4
#define G4DBF5                           BANKMASK(COG4DBF), 5
#define G4DBR0                           BANKMASK(COG4DBR), 0
#define G4DBR1                           BANKMASK(COG4DBR), 1
#define G4DBR2                           BANKMASK(COG4DBR), 2
#define G4DBR3                           BANKMASK(COG4DBR), 3
#define G4DBR4                           BANKMASK(COG4DBR), 4
#define G4DBR5                           BANKMASK(COG4DBR), 5
#define G4EN                             BANKMASK(COG4CON0), 7
#define G4FDBS                           BANKMASK(COG4CON1), 6
#define G4FIS0                           BANKMASK(COG4FIS0), 0
#define G4FIS1                           BANKMASK(COG4FIS0), 1
#define G4FIS10                          BANKMASK(COG4FIS1), 2
#define G4FIS11                          BANKMASK(COG4FIS1), 3
#define G4FIS12                          BANKMASK(COG4FIS1), 4
#define G4FIS13                          BANKMASK(COG4FIS1), 5
#define G4FIS14                          BANKMASK(COG4FIS1), 6
#define G4FIS15                          BANKMASK(COG4FIS1), 7
#define G4FIS2                           BANKMASK(COG4FIS0), 2
#define G4FIS3                           BANKMASK(COG4FIS0), 3
#define G4FIS4                           BANKMASK(COG4FIS0), 4
#define G4FIS5                           BANKMASK(COG4FIS0), 5
#define G4FIS6                           BANKMASK(COG4FIS0), 6
#define G4FIS7                           BANKMASK(COG4FIS0), 7
#define G4FIS8                           BANKMASK(COG4FIS1), 0
#define G4FIS9                           BANKMASK(COG4FIS1), 1
#define G4FSIM0                          BANKMASK(COG4FSIM0), 0
#define G4FSIM1                          BANKMASK(COG4FSIM0), 1
#define G4FSIM10                         BANKMASK(COG4FSIM1), 2
#define G4FSIM11                         BANKMASK(COG4FSIM1), 3
#define G4FSIM12                         BANKMASK(COG4FSIM1), 4
#define G4FSIM13                         BANKMASK(COG4FSIM1), 5
#define G4FSIM14                         BANKMASK(COG4FSIM1), 6
#define G4FSIM15                         BANKMASK(COG4FSIM1), 7
#define G4FSIM2                          BANKMASK(COG4FSIM0), 2
#define G4FSIM3                          BANKMASK(COG4FSIM0), 3
#define G4FSIM4                          BANKMASK(COG4FSIM0), 4
#define G4FSIM5                          BANKMASK(COG4FSIM0), 5
#define G4FSIM6                          BANKMASK(COG4FSIM0), 6
#define G4FSIM7                          BANKMASK(COG4FSIM0), 7
#define G4FSIM8                          BANKMASK(COG4FSIM1), 0
#define G4FSIM9                          BANKMASK(COG4FSIM1), 1
#define G4LD                             BANKMASK(COG4CON0), 6
#define G4MD0                            BANKMASK(COG4CON0), 0
#define G4MD1                            BANKMASK(COG4CON0), 1
#define G4MD2                            BANKMASK(COG4CON0), 2
#define G4PHF0                           BANKMASK(COG4PHF), 0
#define G4PHF1                           BANKMASK(COG4PHF), 1
#define G4PHF2                           BANKMASK(COG4PHF), 2
#define G4PHF3                           BANKMASK(COG4PHF), 3
#define G4PHF4                           BANKMASK(COG4PHF), 4
#define G4PHF5                           BANKMASK(COG4PHF), 5
#define G4PHR0                           BANKMASK(COG4PHR), 0
#define G4PHR1                           BANKMASK(COG4PHR), 1
#define G4PHR2                           BANKMASK(COG4PHR), 2
#define G4PHR3                           BANKMASK(COG4PHR), 3
#define G4PHR4                           BANKMASK(COG4PHR), 4
#define G4PHR5                           BANKMASK(COG4PHR), 5
#define G4POLA                           BANKMASK(COG4CON1), 0
#define G4POLB                           BANKMASK(COG4CON1), 1
#define G4POLC                           BANKMASK(COG4CON1), 2
#define G4POLD                           BANKMASK(COG4CON1), 3
#define G4RDBS                           BANKMASK(COG4CON1), 7
#define G4RIS0                           BANKMASK(COG4RIS0), 0
#define G4RIS1                           BANKMASK(COG4RIS0), 1
#define G4RIS10                          BANKMASK(COG4RIS1), 2
#define G4RIS11                          BANKMASK(COG4RIS1), 3
#define G4RIS12                          BANKMASK(COG4RIS1), 4
#define G4RIS13                          BANKMASK(COG4RIS1), 5
#define G4RIS14                          BANKMASK(COG4RIS1), 6
#define G4RIS15                          BANKMASK(COG4RIS1), 7
#define G4RIS2                           BANKMASK(COG4RIS0), 2
#define G4RIS3                           BANKMASK(COG4RIS0), 3
#define G4RIS4                           BANKMASK(COG4RIS0), 4
#define G4RIS5                           BANKMASK(COG4RIS0), 5
#define G4RIS6                           BANKMASK(COG4RIS0), 6
#define G4RIS7                           BANKMASK(COG4RIS0), 7
#define G4RIS8                           BANKMASK(COG4RIS1), 0
#define G4RIS9                           BANKMASK(COG4RIS1), 1
#define G4RSIM0                          BANKMASK(COG4RSIM0), 0
#define G4RSIM1                          BANKMASK(COG4RSIM0), 1
#define G4RSIM10                         BANKMASK(COG4RSIM1), 2
#define G4RSIM11                         BANKMASK(COG4RSIM1), 3
#define G4RSIM12                         BANKMASK(COG4RSIM1), 4
#define G4RSIM13                         BANKMASK(COG4RSIM1), 5
#define G4RSIM14                         BANKMASK(COG4RSIM1), 6
#define G4RSIM15                         BANKMASK(COG4RSIM1), 7
#define G4RSIM2                          BANKMASK(COG4RSIM0), 2
#define G4RSIM3                          BANKMASK(COG4RSIM0), 3
#define G4RSIM4                          BANKMASK(COG4RSIM0), 4
#define G4RSIM5                          BANKMASK(COG4RSIM0), 5
#define G4RSIM6                          BANKMASK(COG4RSIM0), 6
#define G4RSIM7                          BANKMASK(COG4RSIM0), 7
#define G4RSIM8                          BANKMASK(COG4RSIM1), 0
#define G4RSIM9                          BANKMASK(COG4RSIM1), 1
#define G4SDATA                          BANKMASK(COG4STR), 4
#define G4SDATB                          BANKMASK(COG4STR), 5
#define G4SDATC                          BANKMASK(COG4STR), 6
#define G4SDATD                          BANKMASK(COG4STR), 7
#define G4STRA                           BANKMASK(COG4STR), 0
#define G4STRB                           BANKMASK(COG4STR), 1
#define G4STRC                           BANKMASK(COG4STR), 2
#define G4STRD                           BANKMASK(COG4STR), 3
#define GCEN                             BANKMASK(SSP1CON2), 7
#define GIE                              BANKMASK(INTCON), 7
#define HFIOFL                           BANKMASK(OSCSTAT), 3
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define HIDB0                            BANKMASK(HIDRVB), 0
#define HIDB1                            BANKMASK(HIDRVB), 1
#define INLVA6                           BANKMASK(INLVLA), 6
#define INLVA7                           BANKMASK(INLVLA), 7
#define INLVB0                           BANKMASK(INLVLB), 0
#define INLVB1                           BANKMASK(INLVLB), 1
#define INLVB2                           BANKMASK(INLVLB), 2
#define INLVB3                           BANKMASK(INLVLB), 3
#define INLVE3                           BANKMASK(INLVLE), 3
#define INLVLA0                          BANKMASK(INLVLA), 0
#define INLVLA1                          BANKMASK(INLVLA), 1
#define INLVLA2                          BANKMASK(INLVLA), 2
#define INLVLA3                          BANKMASK(INLVLA), 3
#define INLVLA4                          BANKMASK(INLVLA), 4
#define INLVLA5                          BANKMASK(INLVLA), 5
#define INLVLB4                          BANKMASK(INLVLB), 4
#define INLVLB5                          BANKMASK(INLVLB), 5
#define INLVLB6                          BANKMASK(INLVLB), 6
#define INLVLB7                          BANKMASK(INLVLB), 7
#define INLVLC0                          BANKMASK(INLVLC), 0
#define INLVLC1                          BANKMASK(INLVLC), 1
#define INLVLC2                          BANKMASK(INLVLC), 2
#define INLVLC3                          BANKMASK(INLVLC), 3
#define INLVLC4                          BANKMASK(INLVLC), 4
#define INLVLC5                          BANKMASK(INLVLC), 5
#define INLVLC6                          BANKMASK(INLVLC), 6
#define INLVLC7                          BANKMASK(INLVLC), 7
#define INLVLD0                          BANKMASK(INLVLD), 0
#define INLVLD1                          BANKMASK(INLVLD), 1
#define INLVLD2                          BANKMASK(INLVLD), 2
#define INLVLD3                          BANKMASK(INLVLD), 3
#define INLVLD4                          BANKMASK(INLVLD), 4
#define INLVLD5                          BANKMASK(INLVLD), 5
#define INLVLD6                          BANKMASK(INLVLD), 6
#define INLVLD7                          BANKMASK(INLVLD), 7
#define INLVLE0                          BANKMASK(INLVLE), 0
#define INLVLE1                          BANKMASK(INLVLE), 1
#define INLVLE2                          BANKMASK(INLVLE), 2
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAF6                           BANKMASK(IOCAF), 6
#define IOCAF7                           BANKMASK(IOCAF), 7
#define IOCAN0                           BANKMASK(IOCAN), 0
